["I'm white and I won't go anywhere near Alabama. https://t.co/onuzwbOsVb", "Another chief leaves Trump's manufacturing council\nhttps://t.co/NqZDz9WMkw", "@SenWarren No he didn't #fauxcohontas! He condemned those who participated in the violence at #Charlottesville on both sides!", "https://t.co/zA33WQp977 #News Histórico líder de KKK alaba a Trump por ‘decir la verdad’ de Charlottesville https://t.co/Y5fOI9FYLm", "\"@DavidEMcK59 @cathymdonker @southoflife75 @SusanDa50168535 @timkaine @realDonaldTrump Like first crime I noticed in this Charlottesville BS was kidnapping. Done by the opposition or so called left. you can't block people's....\"", "Depuis le drame de #Charlottesville, il me semble que le concept de #PointGodwin a volé en éclats.", "I try to watch,I just can't stomach him. https://t.co/0z9VKCssNa", "Get....  out.... https://t.co/dSJqIzQMAV", "The folks that protested vs the nazis @ #Charlottesville are real patriots , neo Nazism has no chance here in America", "Charlottesville murder suspect failed basic training at Fort Benning in 2015 - https://t.co/rWRAnLA3us", "\"@ScottMGreer Here's a post from one of your @DailyCaller kameraden urging Right Wingers to drive cars into 'liberal protestors.' #Charlottesville https://t.co/wcufG3vKQ1\"", "DONALD DEFIANT: Blame on both sides https://t.co/opwHgY48La", "@jojoh888 so antifa conquered virginia &amp; charlottesville", "No, Mr Trump, we're not the same as the neo-Nazis | Emily Gorcenski https://t.co/RgdfGHaSpQ", "She'll delete this soon. Watch. https://t.co/Vj1Mvxvw5P", "Perfect ⬇️ https://t.co/Leprq2eMde", "The police are in it. Shame on the mayor and the leadership of VA. https://t.co/RRvLm2Kkc6", "\"@CNN someone should remind #JanBrewer of this photo (and to have more than 1 talking point) CC: @ananavarro #Charlottesville https://t.co/9VkFnr3VDL\"", "\"@pearl_of_truth @RegBarclay2017 @guardianelm @_Grafik_ @midnughttune @Lyn1350 @SoCal4Trump @MittRomney That's also not what other former Trump supporters think. https://t.co/SBsq1qfOgG\"", "\"I am quickly seeing how wrong the media has twisted what happened to fit their own narrative.  Those people are screaming and provoking. Smh https://t.co/XKsJw02nYp\"", "It truly is incredible what they put together in a very short time. Worth a watch. https://t.co/mU3E1Lsowc", "\"米国社会の分断：差別主義、トランプ政権で勢い\\n#外務省　#渡航禁止　#企業　#自治体　#学生　#大学生\\n#Virginia #Charlottesville #JamesAlexFields\\n#Trump: \\\"What are we teaching our children?\\\" https://t.co/v34KWXwt2m\"", "@clayaiken @Twitlertwit @realDonaldTrump #Charlottesville https://t.co/h4SJ18dGJZ", "\"Trump fires back at critics of his Charlottesville response\" via FOX NEWS https://t.co/W8Jq3NUQ0G", "Newt Gingrich just compared Robert E. Lee to Buddha. 🙄 #Charlottesville #Charolettesville #Charlotteville", "‘I’m glad that girl died’ during Charlottesville protest, N. Carolina KKK leader says\nhttps://t.co/nbhRDRhwW9", "Charlottesville: Race and Terror – VICE News Tonight on HBO https://t.co/Ex4MU1YF2D", "@ABCPolitics @SenJohnMcCain Fuck off and die already Songbird\nhttps://t.co/YVZ0O8vVsC\nhttps://t.co/we3edrH2VD https://t.co/ylGsbXbUNh", "@powerje No, Trump's statements were designed to condemn both the fascists and communists who were involved in Charlottesville.", "I agree with @realdonaldtrump The Left Started it. The Right responded. Blood on both our hands. https://t.co/EbkW0hgFZw #Charlottesville", "\"😭😥🤧\\\"Trump\\\" is making a right mess these days, Obama, were are youuuu😱😳, ...😤😡#ImpeachTrump #Charlottesville\\n🙈🙉..💨...🌪...(((💥))) https://t.co/i9eQa8cMpF\"", "\"LMAOOOOOOOO. that's literally like saying the Allies should not have attacked the Germans in WW2 because their visas didn't get issued https://t.co/06tEmUTmuA\"", "How the alt- left protests began #tcot #Charlottesville https://t.co/yjxzOLdGSy", "@JohnLEE79289477 @Arn55998898 Or you can go to Charlottesville or listen tRump defend the Nazis", "His staff is complicit https://t.co/yl6I7mpAKa", "Wow. Khizr Kahn, the Gold Star father who Trump feuded with last year, is also a #Charlottesville resident. https://t.co/MtrOCRIeuu", "\"@glynnwashington In the next breath he plugged a winery he owns in Charlottesville. After dog whistle excusing the kkk &amp; nazis. The horrible man has no clue.\"", "Class act. https://t.co/EY35CU3KZd", "\"Chief of Staff Kelly, for the sake of your own reputation, sir, resign. Walk away from the madness that is @realDonaldTrump. https://t.co/X6y6orLEBs\"", "\"@realDonaldTrump Like who?  After #Charlottesville speech today I really doubt ANY CEO want to support @POTUS.  Go ahead, tell us who the \\\"many\\\" are?\"", "We need to get rid of Trump NOW.\n\nhttps://t.co/hgeZfFTCoW", "LeBron spoke out on the Charlottesville incidents and his so called \"fans\" told him to stick to bball as if he is just some slave to", "Facebook Gave a Neo-Nazi Website a Huge Assist in Spreading Hate After Charlottesville | Alternet https://t.co/mNAxoN9kgy", "LET THEM TRY https://t.co/ISllB3Frj3", "So he lied about this shit too 😂😂😂💀💀💀 https://t.co/kcgJVn5Hdw", "TRAX music guide is up! https://t.co/kike0LERl6 #charlottesville", "@FoxNews @foxandfriends https://t.co/1eaWCfF1Rg", "I liked a @YouTube video https://t.co/KuvbL7D43k What Just Happened In Charlottesville?!!", "\"@PatrickPriceTV @cher @jimmyfallon @NancySinatra \\n@ABC @MSNBC @cnnbrk \\n@realDonaldTrump U #PIG!\\n@BillKarins @billclinton \\n@BarackObama Xx ♡♡ https://t.co/TRjAez7DuC\"", "@YesYoureRacist   can you add all these ppl from this? https://t.co/IhPb5hXdkD", "ah right this is why I don't read you https://t.co/QQlrJ15NzW", "IA stands with our brothers and sisters of Charlottesville!!♥️ #Charlotteville #IAstrong https://t.co/ng5j1IkQEo", "Trump defends his Charlottesville statements: Alt-left shares blame, Asks reporters define \"alt-right?\" https://t.co/XXgy84CZNd via @YouTube", "Hey, friends who agree that racism is unacceptable: this is our candidate in Alabama and he needs help. https://t.co/aUKdkTuztJ", "Watching Don Lemon on CNN. At least \"The Rachel\" is making a comeback? Nope, I can't even laugh today, feels like a funeral.#Charlottesville", "Heil Donald !!! https://t.co/9CZ7N8aWQh", "@jonlovett https://t.co/9JXuDMlw7G", "Wow not so big surprise of the poll since it was sent out to your base.  I guess Antifa is not a threat to ppl. https://t.co/L1JQbogadA", "Is it bizarro world when Jeff Sessions calls White Supremacists terrorists &amp; a US President calls them fine people? #Charlottesville", "#Charlottesville https://t.co/yW8gFCZv1U", "\"@BlissTabitha What's amazing is NOT @POTUS calling out the violence from both ANTIFA &amp; Neo-Nazis.. \\nit's that the MSM &amp; DC Elite are NOT #Charlottesville\"", "\"Is it a shocker that a political rally in #Charlottesville in AUGUST had violence? Stressed, overheated folk are so calm and chipper.. not.🤔 https://t.co/Rl0dFpizUM\"", "A drowning man who would step on the shoulders of his comrades to keep his head above water. https://t.co/o6axRpYnGx", "VIDEO: Trump OBLITERATES the media after they attack him over Charlottesville https://t.co/ESex9tHL7z", "Pathetic actually. No more talk. Only action matters. https://t.co/KibLulIgAQ", "Faith Goldy: Charlottesville, In My Own Words https://t.co/YFprZnLoAz via @YouTube", "Mark Levin\n\n\"Fake news MEDIA crossexamine Trump as if they were @ Charlottesville. CNN Anderson Cooper nowhere near there. Show video proof\"", "dcexaminer Barack Obama's response to Charlottesville becomes second most-liked tweet https://t.co/EhPnT2WY2v https://t.co/cjAENVUzlh\n\nBa…", "\"@RodStryker @gkistler75 @BlackandBlondeM @Dollfinish @ANOMALY1 @American1765 @DiagonalDoug @GeorgiaDirtRoad @jimlibertarian @NIVIsa4031 @LeahR77 @ThePatriot143 @surfermom77 @thebradfordfile https://t.co/XN4uGUXhaE\"", "JAJAJAJAJAJAJAJA https://t.co/xf5YYUIrsA", "\"Paris Dennard\" a black gay man defending Trump. If he had been in Charlottesville on Saturday, he would have been killed by Trump's Base!", "\"@pattonoswalt @JohnCzer1 Russia Reports CIA “Genocide Expert” Orchestrated Charlottesville Mob Violence  https://t.co/YhL0rLDyrq https://t.co/k8KExi8qO3\"", "Jesus Christ he's a maniac https://t.co/3QCbzwrjBe", "https://t.co/Ppu7RzWiwE", "It's now #1 @POTUS44 https://t.co/jiCYCVVAbN", "RT CNN \"A public memorial service for Heather Heyer will be held Wednesday morning in Charlottesville, Virginia… https://t.co/3xV5ZyhFRq\"", "I teared up listening to him. I'm absolutely ♥️broken https://t.co/bmdlb5O5Pp", "OMFG! https://t.co/eXScCOIavg", "#ArnoldSchawrzenegger dona 100 mil dólares a organización “anti-odio” tras sucesos en… https://t.co/qhw9131ejp https://t.co/Q6GRQmr5c1", "Photographer perfectly shuts down Fox News' request to use his Charlottesville photos https://t.co/LAHuL47yd1", "This also felt amusingly dry. https://t.co/3P2UENvLsa https://t.co/xDGmUah9rO", "Analysis: 2 sides of Charlottesville not equal - CBS News reporter Paula Reid was on the ground in Charlottesvi... https://t.co/FR0Tn7jdEK", "@ellieemillerrr @Caspar_Lee https://t.co/grOjljYu2g", "'It Was a Moral Disgrace': Krauthammer Spars with Ingraham Over Trump, Charlottesville https://t.co/CJTKeJirv7", "#News| Republicans denounce bigotry after Trump's latest Charlottesville remarks  https://t.co/8v2Yx2trhP https://t.co/kfzrvS8iFg", "Nazis in Charlottesville served as \"fluffers\" to Antifa goons hell-bent on f--king Trump supporters while cucked cops watched and cheered.", "Y'all  really elected this man.... https://t.co/AHV2SyxzNc", "An amazing opinion piece --  NY Times:  What Jewish Children Learned From Charlottesville https://t.co/PQP1fDCl75", "Trump, you are not a decent person. https://t.co/N9gDGAH93u", "\"My God the man is delusional. He has no moral compass. @maddow @RollingStone @costareports @ddlovato @springsteen @SherylCrow @MLB @NFL https://t.co/6kK2ywxvoH\"", "This Reporter Just Leaked Who’s Behind Charlottesville Riots And It’s HORRIFYING https://t.co/QsUNlZwR3y via @liberty_writers", "Trump's favourite conspiracy theorist suggests Charlotsville protesters 'just Jewish actors' https://t.co/0n0YCuqIDU", "Jones: 'I'm without words' on Trump's response to Charlottesville https://t.co/zFItvHYgJO", "Obama’s Charlottesville tweet becomes second most liked ever https://t.co/iVJkjiPgF4 via @CNET", "Imagine that, another lie. 🤔 https://t.co/AnXHDh1j32", "Because I am a doctor of education 🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾 https://t.co/Nw5uq3eIsm", "Charlottesville is not FAR just like Ferguson wasn't far. This shit will come to ur city next.", "I need a poem  by @elguante about #Charlottesville !!", "\"@Enrique_Acevedo Based on the @vicenews report on Charlottesville I can say that neo nazis target Blacks and Jews the most. Trump immigrants like team work!\"", "Another statement from the church in regards to what has been happening in Charlottesville, Virgina https://t.co/JWR6SV84Uo", "Please read the first 3 words of the tweet you're responding to. https://t.co/4vFy2CozoF", "@SenSanders He condemned the violence, what more do you want, for him to go to #Charlottesville and stop them himself, shut up old man", "\"@Daradol1 @UrsiniJohnu @CoolHandLukeX1 @ABC @ACLUVA LA ain't Charlottesville. Raised w/ long distance firing range on our farm in Fl. I can shoot. But there's no loaded open carry here in LA.\"", "don't even need to turn on volume https://t.co/6zajrBlGnS", "\"They pour the petrol and then wonder why it burns.\" \nSearing indictment of politicians &amp; media by @OwenJones84 https://t.co/uxQaFehMt1", "AP Definitive Source | How to describe extremists who rallied in Charlottesville\n\nhttps://t.co/Z3VTL50kCW", "Bumping this, because I'm dead serious, I keep seeing the left say this, but strangely no example appears to exist. https://t.co/Op4Y6DoUDF", "\"#Politics Trump defends participants in white-supremacist rally in Charlottesville https://t.co/yIjbf7JJ5K ^WashingtonPost https://t.co/3MdhjspRfm\"", "Trump has now lost 6 members of his manufacturing council since Charlottesville https://t.co/pvfRUgs5Mc", "Trump again blames 'both sides' in Charlottesville, says some counterprotesters were 'very, very violent' https://t.co/Tr81AZamRy", "@adigoesswimming oh my god https://t.co/bvspVjcgKl", "\"So-called @POTUS ,\\nThe Confederacy was an ENEMY to the UNION that you were sworn to protect! \\nWTFU America this evil must go.\\n\\n#Impeach45 https://t.co/jU242ozjgN\"", "@JordanChariton https://t.co/9JXuDMlw7G", "@FoxNews @NFL https://t.co/AUMaBG2XYS", "\"@StefanMolyneux @AnnCoulter how does this justify what happened in #Charlottesville ?  False equivalency tactic is getting old! @timkaine https://t.co/07ZznxGeH8\"", "@WhiteHouse https://t.co/oKEuChPU2c", "\"#maddow's right, Trump is legitimizing the politics of white supremacists and neo-nazis by whitewashing their immoral views #charlottesville https://t.co/EtTMfczUWD\"", "Dallas, TX - Alex Jones Says Jewish Actors Posed As KKK Followers In Charlottesville https://t.co/sBPph9mzFO", "Probecito... https://t.co/9i17Gpujfk", "President Trump Leads The Way By Condemning Violence That Took Place On Both Sides In Charlottesville Riots https://t.co/JI2lakL1S0", "Another Reversal: Trump Now Says Counterprotesters Also To Blame For Charlottesville https://t.co/G1akO9FNMp", "The latest innit mate! https://t.co/BbZ9hoM8oT #charlottesville #plo", "Resisting Trump's Racism #Charlottesville #TrumpIsARacist  https://t.co/N4bxOAokIV", "Watch the Vice Documentary on the Charlottesville White Supremacy Rally https://t.co/GvapUvw0vS", "@USAGSessions #ChristopherWray why is this ass not arrested? What are you doing? #DoYourJob https://t.co/CVpVyZnhbp", "Charlottesville, el rostro blanco del extremismo https://t.co/tEAwFiJrpi vía Granma", ".@realDonaldTrump  @POTUS did you really just promote your stupid winery while talking about the tragedy in Charlottesville? Shame on you!", "Women in rammed car file $3M lawsuit against white nationalists for inciting #violence https://t.co/vUDu1QAczf", "Fox host goes into meltdown mode over Trump’s latest Charlottesville comments: ‘Disgusting!’ https://t.co/gPaNm9KmF2", "I agree with President Trump. Both sides were to blame. Both the Nazi &amp; The KKK were equally to blame for #Charlottesville", ". #ImpeachTrump #Charlottesville  https://t.co/zpV5mOTl3W", "Where's my 6 iron? https://t.co/UegRKWSlDQ", "\"@ReallyDontTrump @TrueFactsStated @LadyJustice_25 Really I don't see how @kayleighmcenany can spout that drivel. It's going to choke her soon - pure poison... 😡#ImpeachTrump #Charlottesville\"", "#winery #Trump #Charlottesville https://t.co/UH8nvvvYuW", "Terrorist Who Beat Deandre Harris With A Pipe in Charlottesville Found On Social Media. Updated. https://t.co/o3jDfgrBep", "@PGourevitch https://t.co/c3FTbYdfg9", "I liked a @YouTube video https://t.co/YpIoM0WyFA #Charlottesville: Happy Birthday George Soros, American Society Controlled Demolition", "thehill: WATCH: Fox News host blasts Trump's Charlottesville comments as \"one of the biggest messes I’ve ever seen… https://t.co/CTGUzYQmFR", "@realDonaldTrump https://t.co/cM68MDuAnq", "\"There is no room in this sacred promise for hatred, racism, violence and intolerance.\" #standuptoterror https://t.co/fdaV7n9MN3", "The @GOP needs to speak up against this and also impeach Trump https://t.co/nsUj1Bj0rN", "Gostei de um vídeo do @YouTube https://t.co/WTGeAoXW7s Charlottesville: Tochas, Terroristas e Trump", "Racist Dem , Oh No !!!! https://t.co/OBfdJJZqcg", "Charlottesville Democrat Resigns As His Racist Messages LEAK https://t.co/lNlqhzlnud", "Trump doubles down on blaming \"both sides\" on Charlottesville - https://t.co/5Hh43N0F0e https://t.co/XtiXPjh38U", "FOXNEWS reports 'I Guess It Depends on What is Hateful': TuckerCarlson Debates Writer on 'Hate Speech'  #Tucker\n https://t.co/thEEJ4xEtr", "And Russians, and dictators, and zenophobes, and misogynists, and anti-environmentalists... #ImWithMueller https://t.co/eWOMVagBN3", "Charlottesville Mayor Lays Blame for Violence on President Trump https://t.co/gv8PcM2CpE", "RT AC360: Clinton supporter on POTUS' Charlottesville violence remarks: \"What happened today was an American abomination\"", "@realDonaldTrump in case you are confused. #Charlottesville #25thAmendmentNow #ImpeachTrump https://t.co/K8zNZ7ddC0", "@Kronykal Lol she lays it out well Check out @MamaReg2's Tweet: https://t.co/w4gTrkmCXI", "Just think about telling your kids about Donald Trump and he did your country https://t.co/qdZOwtccbQ", "\"@drumandkoch @BAGTY_ Look I openly admitted Charlottesville was an entirely different caliber, but KKK/Nazi public demonstration is disgusting either way no?\"", "\"@SusanHowson @RossCatrow Wait. Charlottesville happened here but I don't accept that's who we are. Lots of work to do wherever we fall in the 1 to 50 ranking.\"", "\"Do the right thing all the time, &amp; refuse to associate with morally bankrupt people. Remember the silence of friends. #Charlottesville https://t.co/nAOrT4T6tV\"", "@JoeNBC Trump came out and denounced the violence that both sides caused in Charlottesville. What else does he have to do to shut you up?", "Friday night: watch sermon by Dr. Traci Blackmon  Faith-Led Counter-Protest to White Nationalism in Charlottesville https://t.co/yTWh49hMu9", "NC KKK leader says he glad a protestor died in Charlottesville, Virginia | Charlotte Observer #SmartNews  https://t.co/f5zTz0iFVk", "Charlottesville Victim Heather Heyer’s Family Asks Mourners to Wear Purple to Memorial Set for Wednesday https://t.co/MpSdQFG7iL #celebrit…", "Trump Defends His Late Response To Charlottesville And Blasts The “Alt-Left” https://t.co/lE3I6Xv4Dr", "22After Charlottesville, Trump retweets — then deletes — image of train running over CNN reporter https://t.co/iWs69a1LmG", "Mitt Romney Just Gave A Bold Response To Trump’s Charlottesville Press Conference https://t.co/rChU7LVeWE https://t.co/lCbGCIQXXp", "\"This thread has broken me. Please read and imagine this happening while you're in your church. My heart hurts and I'm crying hard right now. https://t.co/vRdj9jvITA\"", "\"#Charlottesville Creepy as fuck😩 #CharlottesvilleKKK What do the white girl have to do wit anything #BlackLivesMatter https://t.co/4zudI7SRXw\"", "Black people don't get to move past it. I'm really sad north west has to have you as a mom . https://t.co/3WHPaXWJr7", "Such lies!  This is a man who wants to equate George Washington with Robert E Lee!!! https://t.co/oProlOQkyV", "@realDonaldTrump's right not all people protesting in Charlottesville were White Supremacists.\nSome are self-loathing hate-filled assholes.", "A Twitter campaign is outing people who marched with white nationalists in Charlottesville https://t.co/1kY8UYab8g", "Is Lebron too big of a Superstar to get the Kaep treatment? 🤔🤔🤔 https://t.co/EQVGH76kyE", "When all else fails blame Obama https://t.co/1eqXW5JvqT", "Hard to watch, but important to see the truth dying in the streets. #Charlottesville: Race and Terror – VICE News https://t.co/8k13pboYO2", "Trump defends his late response to Charlottesville and blasts the media https://t.co/mJAPGgc0cl", "Real people,  Patriots, that love this country and our constitution and understand what the First Amendment is https://t.co/1wzcTWXrCM", "Some actual journalism, and from VICE no less. ( 20 min documentary on Charlottesville )  https://t.co/PZwZDAzeiT", "Really?? https://t.co/X3qo78M560", "Combative Trump backtracks, again lays Charlottesville blame ‘on both sides’ as aides stand in silence https://t.co/uba9D6kbFP", "Trump is right again!!! https://t.co/c32hpITHJG", "\"Learn from a REAL POTUS @BarackObama U @realDonaldTrump R a DISGRACE#ImpeachTrumpNow #ImpeachTrump #WhiteSupremacist #TrumpIsNotAGoodPerson https://t.co/g2tFfHuG9R\"", "@mikiebarb Thanks, really good background to statue story, so much better than the twisted local take cf. https://t.co/ofb3nTbQdi via @cjr", "Hate vs. Love in Charlottesville, Va. (Photos) https://t.co/nnUlygry1G https://t.co/Cr810YV5gg", "Tell them Bernard. Again for those in the back. https://t.co/vkcOLQPNAy", "\"@DNC   25th AMENDMENT NOW!!  WE CAN'T WAIT FOR AN IMPEACHMENT!! MAN IS MORALLY UNFIT TO CARRY OUT THE DUTIES OF POTUS!!! https://t.co/v3mmML4SML\"", "@Nolan_Mc Who says anyone fed him those thoughts? https://t.co/Lkizpk0H1K", "Donald Trump's failure in Charlottesville wasn't political -- it was moral @CNNPolitics https://t.co/29vcOJNqgX", "@justinamash This is the man who fueled the other side. Read and watch. https://t.co/UnDfnsLy8r Hope you can start supporting @POTUS", "Not even the WSJ is on his side anymore — \"W/new remarks on Charlottesville, Trump leaves himself isolated\" https://t.co/MQC9UApOv5 via @WSJ", "Thank you @WorldLearning CEO Don Strindberg for your words of strength and unity. https://t.co/rGPj5CmfoN", "@JoyAnnReid here's that reaction shot you were looking for. https://t.co/pecQOH4MHb", "#Charlottesville #Trump https://t.co/mo6GPB6oyB", "Who was responsible for the violence in Charlottesville? Here’s what witnesses say https://t.co/587IFOKkvL", "Top story: David Duke on Twitter: \"Thank you President Trump for your honesty &amp;… https://t.co/V7Fx0pARTt, see more https://t.co/GBmptt49py", "They weren't \"very nice people.\" The truth a/b those who marched Friday evening in #Charlottesville is chilling. https://t.co/a21lkh7O7I", "no shit https://t.co/6repsLPiEd", "After #Charlottesville, more cities are moving to take down Confederate monuments https://t.co/RKif3dezEf https://t.co/cD00ARuKTn", "\"Don't you think you owe it to your children to call out your father for his repugnant remarks today? @IvankaTrump @realDonaldTrump https://t.co/FSl10eqjFR\"", "This after reports that a leader of one of the neo-Nazi groups in Charlottesville served in the Marines https://t.co/qW7IYIhZwO", "America can't be gr8 again with events like Charlottesville. The events are sickening/horrifying &amp; it's sad it's come to this. (2/2)", "White supremacy is a problem white people need to solve. Let's talk about how best to do that. https://t.co/sJ8e7kqH4Z", "Where are those #veryfinepeople https://t.co/hRLnUWPiAw", "Here's the difference. We all condemn alt-right #Charlottesville. They choose to ignore any alt-left riots and beatings.", "65% said yes. Hmmm. Idk. https://t.co/IOv9ZZSkhk", "Líder de KKK alaba a Trump por \"decir la verdad\" de Charlottesville https://t.co/y76SauY1uQ", "Thats true love💯 https://t.co/99XUNsa2HI", "\"@MatthewModine @POTUS @FoxNews @TuckerCarlson Always about personal profits... The only reason Trump cares about #Charlottesville https://t.co/7YcJAmNR0m. https://t.co/o6W6sG44mE https://t.co/FqloCkrUU5\"", "@mitchellvii Fox News Host Slams Trump’s Response to Charlottesville\n  https://t.co/miZzqoUJTJ", "\"米国社会の分断：差別主義、トランプ政権で勢い\\n#外務省　#渡航禁止　#企業　#自治体　#学生　#大学生\\n#Virginia #Charlottesville #JamesAlexFields\\n#Trump: \\\"What are we teaching our children?\\\" https://t.co/FaQxHetgxU\"", "From \"many sides\" to \"two sides\"  called PROGRESS!! https://t.co/tB3eYxPKGG", "You don't need a permit to protest! You IDIOT. 😡 He's literally defending nazis who KILLED an innocent person! https://t.co/SWAjEHKNwW", "@AllanMargolin @thedailybeast @JimKilbane @Normsmusic Oh I wish he would go to Charlottesville. He would see what people really think of him", "I watched Trump all last year. His response to Charlottesville was no surprise. https://t.co/scrPd6SP0i", "\"#ImpeachTrump Three Days Gone, And Trump Has Not Reached Out To Charlottesville Victim’s Family https://t.co/kUYIFs0GBk https://t.co/9zuBhGzjGx\"", "RT FoxNews \".newtgingrich on #Trump Press Conf Fallout: 'Everybody Who Went Insane Is Insane' https://t.co/VONXihqzkU\"", "\"#ImpeachTrump Clay Aiken Just Broke The Internet With His Response To Trump’s Charlottesville Presser https://t.co/NWPMlkSGcR https://t.co/7HxzUfioBM\"", "🤡 https://t.co/05aZbcWQ3O", "I watched this and then stared at the ceiling for about 20 minutes https://t.co/VHbowF1R45", "https://t.co/H4f3XjqNV7", "Reporter: Are you going to Charlottesville?\n\nTrump: Did you know I own a big winery there?\n\nMe: 😶 \n\n https://t.co/qYwEIrNI1o", "Your MCM voted for the first nazi president ever https://t.co/3eonnoO9ue", "\"Or BLM Antifa or any other left wing terrorist group including their propaganda wing @CNN  tell the whole truth or shut up #MAGA https://t.co/qRkmaDLnDE\"", "Y'all... unbelievable. https://t.co/snLeFCH3Lq", "\"#FoxNews on course 4 complete annihilation of US news. \\nHannity #DeadManWalking\\n#Soros extradition order - now rather than later! https://t.co/6ZCcBx0ONY\"", "Pay attention America Chuck hits it out of park https://t.co/t8jPIoDocI", "\"VÍDEO LEGENDADO | Lauren conversa por telefone com a @MTV sobre #Charlottesville: \\\"Não podemos deixar a história se repetir novamente\\\" https://t.co/qj7g8o5eml\"", "#Charlottesville 🍄🍄🍄🍄🍄🍄 https://t.co/xIFdbjfrv0", "This is so fucked up https://t.co/JDtDZ3qNUQ", "\"#ImpeachTrump #impeachTrump #impeachTrump #impeachTrump #impeachTrump #impeachTrump #impeachTrump #impeachTrump #impeachTrump #impeachTrump https://t.co/bq3yxHQb2I\"", "Here's The Dirty Secret About Charlottesville That The Media Will NEVER Admit https://t.co/yGqqlUcIAk via @yesimright1", "Horrifying https://t.co/Gkms31p0bg", "Trump Gives White Supremacists an Unequivocal Boost via @NYTimes https://t.co/b2Hk5KRkcJ", "Former Ohio man 'person of interest' in Charlottesville beating https://t.co/kxxku1t6PM  #ohio", "#Trump remarks about Charlottesville violence - Washington Post https://t.co/VDS60YhgNK", "I'll be at work but with y'all in prayer and spirit! https://t.co/dxWoYdhy8r", "The outrageous editorial by a Charlottesville daily that preceded violence https://t.co/twJKxNyQPD via @cjr", "Officer on fatal Charlottesville crash: 'Hahahaha love this' https://t.co/qJBDHD3GfZ", "Hell yes. https://t.co/rEVRscFS2v", "\"@IndivisibleTeam isn't it time to call and write these companies they way we have been calling and writing our sens/reps? https://t.co/ytRWbgrgGe\"", "today was not good to say the least, but the last 20 seconds of this video brought me some joy https://t.co/qELI4t0bpr", "Discord Was the Alt-Right’s Favorite Chat App. Then Came Charlottesville. https://t.co/rFtvRmHKDw", "\"@realDonaldTrump has proven over and over again that he can't do a damn thing right. Suck a #racistfuckup #Charlottesville https://t.co/NvWx8IHtHR\"", "\"@jimmykimmel @BachelorABC @BachParadise Has this gotten many \\\"How dare you joke about kids being run over three days after Charlottesville!\\\" complaints?  No? Okay, carry on then.\"", "Texas Republican Congressman Hurd demands Trump 'apologize' for latest white supremacist comments https://t.co/0qcSeiL7ul via @mySA #👍🏻", "Holy. This will president has lost it. https://t.co/KnG4ad5Hh1", "Tim Black on Charlottesville, corporate Democrats, and establishment hypocrisy.\n@cthie @Nupe117 @UKProgressive \nhttps://t.co/JDwcIT46Db", "Charlottesville, India's partition, elections in Kenya. Can we overcome our tribalism? Depressing, but the issue keeps popping up again &amp;...", "Alex Jones: Bombshell Connection Between Charlottesville, Soros, CIA -\n https://t.co/0eOIcyg3AZ #infowars", "https://t.co/tBQAbxtibE\n\n@POTUS you've lost touch with reality, or gone  political. There were attacks &amp; defenders. We defended - go to hell", "\"This is a fantastic list of organizations that fight hate in VA. Please consider donating - it's a great way to help even if you're far away https://t.co/6w17FFzOxr\"", "\"Theresa May silent about #Charlottesville \\nTheresa May silent and weirdly absent with so much you going awry #Trump #DavidDavisDebacle https://t.co/YGbbYae3uB\"", "What the actual hell? The common denominator of most of these issues are Democrats. Wake up people https://t.co/MsBtFQayTc", "https://t.co/seEXobKPCF", "Could it be that the organizer of the #Charlottesville rally is a left-wing... https://t.co/dflx9WQ1Mk by #stonewall_sue via @c0nvey", "En medio de fuertes protestas, Trump vuelve a culpar a \"ambos lados\" por la violencia en Charlottesville… https://t.co/g1RTmQCQSI", "Gotta love Krauthammer and not just because of his name. #TrumpPresser #trump #Charlottesville  https://t.co/DpJPzuyhux", "@realDonaldTrump https://t.co/DLXthjs1R7", "\"I'll try and put this in a way that the president might understand: Shut your big fat stupid ugly mouth you goddamn degenerate https://t.co/7bHpeNAPtf\"", "@thehill https://t.co/HobvM1hLem https://t.co/dWaBAmOTkk", "VIDEO=&gt; Antifa Flag Raised Up Over Hennepin County Govt. Center in Solidarity with Charlottesville https://t.co/ofNkwWZ9zj", "#news The White House Talking Points on Charlottesville https://t.co/aGiYkMRFi4", "Uncut PBS Interview with Matthew Heimbach on Charlottesville https://t.co/GcruXNpRVp via @YouTube", "\"Won't be distracted by both sides speech. I can still see Russia (investigation)  from my house.  .@morningmika \\\"alt-left' #Charlottesville https://t.co/BJycUpprZK\"", "Who stood against the people in Charlottesville who marched around carrying tiki torches and hailing Trump with nazi slogans. They-", "Oh my god. Learn some history, Fox News. https://t.co/by8v3RhESM", "This is powerful. A father's love and respect for his daughter. #HeatherHeyer #Charlottesville https://t.co/Z0xvzWhnba", "Ele mesmo, um supremacista. https://t.co/1SkX02oMSO", "Oh BULLSHIT. Yall gave him &amp; THEM the boost. Again and again and again https://t.co/4uszda7HvA", "https://t.co/PIbT8TV1e9     #On Charlottesville, Donald Trump failed America #BreakingNews", "\"This is #whiteprivilege \" https://t.co/AY54Odo2gn", "Follow this to the end and listen to the cop. https://t.co/JX4UJGW6AK", "devastador https://t.co/7rSs9kNBLh", "@realDonaldTrump u are a liar! It's not nor ever was \"Both sides\" in Charlottesville. Clearly U need glasses! Shame shame shame on YOU!", "Organizers and Leaders of Charlottesville's Deadly Rally Raised Money With PayPal - Southern Poverty Law Center https://t.co/vOwHbxFEXA", "\"My concern is that everyone of these from here on out will potentially result in loss of life.  Doesn't everyone else see this? https://t.co/cg0xcXZUkf\"", "#NEWS #POLITICS Donald Trump's failure in Charlottesville wasn't political -- it was moral - CNN: CNN Donald Trump… https://t.co/4ooWXwUkGe", "Charlottesville Violence Advances Agendas of Leftists and Racists https://t.co/9Pt0RfW3kr … https://t.co/7RqYunYfm7", "\"\\\"el que le guste en demasia las cosas materiales, no debería ser político o seminarista\\\" y @realDonaldTrump es un avaro capitalista. https://t.co/mQeGLEPxfs\"", "@potus trying to incite a #civilwar?  #beaman #standagainsthate Trump Gives White Supremacists an Unequivocal Boost  https://t.co/oRQCj3oY48", "\"Passionate tweet threads are step up from being \\\"privately dismayed\\\" and miles from actually doing something to rein in Trump. https://t.co/qN0PEhlXaY\"", "@stevenmnuchin1 @SecElaineChao feel justified standing next to this guy? History is being written. Ur move #Resist  https://t.co/kB2q1Ha6dP", "\"difficult to watch and truly horrifying. these nazis show their true hateful selves, and trump supports them and fuels them https://t.co/6N1GxCoQFo\"", "Y'all please watch this. Please. https://t.co/NcmmVx9LsP", "Thanks @krauthammer for being real https://t.co/KW3Dhqz34l", "\"@FiIibuster @realDonaldTrump Really?  Charlottesville, Chicago very scary cities.  What security? Economy is growing because of demographics not what Trump has done..\"", "I reject you. https://t.co/F4iNJZraAk", "Trump attracts criticism after again blaming \"both sides\" for Charlottesville violence: US… https://t.co/3AyydQcVxo", "Facebook and Reddit ban hate groups in wake of Charlottesville https://t.co/IhUbAkPqaQ https://t.co/Lkvmg2kicv", "@Cernovich Hey mike did you see report i think it was MSM(fox) talked about groups coming in on buses to Charlottesville ?", "\"Now he's got two illegal immigrant whores on his side...@MELANIATRUMP and @AnnCoulter ! Raised both since they were 12! @realDonaldTrump https://t.co/Vw4vpSGQnP\"", "Me ha gustado un vídeo de @YouTube (https://t.co/mAtsA7EUGR - Trump sobre violencia en Charlottesville: \"La culpa es de ambas", "I guarantee that the only thing to come of the @CivilRights investigation into #Charlottesville will be charges against non nazis. No doubt.", "And according to POTUS, lots of \"fine people\". Disgusting. Vice News Documentary from Charlottesville Is Horrifying https://t.co/3g3QqHiTIB", "There is a 71-year-old bigot in the White House. The people who put him there did it on purpose. https://t.co/svbOjHiukw", "\"John McCain: a true American hero and leader. GOP - imagine if this man was President instead of Trump. #ImpeachTrump #Charlottesville https://t.co/PPGK1jsct8\"", "I'm watching this right now and I literally want to throw up. I'm sick to my stomach https://t.co/YFasB9Cyi3", "\"@skenigsberg @kim @JoeBiden Have you guys ever heard of antifa? Or black lives matter?There's your alt left groups..DO NOT make Charlottesville out to be only the right\"", "\"Hey you ding dong @donlemon #Antifa Are the FASCISTS!! Get a CLUE. They've been supporting Fascism all along. They Distort truth, as do you. https://t.co/9OkvAxEmxk\"", "\"Baldy can't look her in eye or at camera bc he: 1) is a coward, 2) knows he's full of shit, 3) knows he's wrong, or 4) all of the above. 🤔 https://t.co/EzxZxcNdmh\"", "\"Sen. @marcorubio addressed 45 directly in a tweetstorm earlier today. (Now if only he'd quit voting with him.) #Charlottesville https://t.co/bHQkogt7F2\"", "You know what to do https://t.co/knz5w0IknV", "#NBA Wire: LeBron James speaks out on Charlottesville tragedy https://t.co/f5M2JvZWLu https://t.co/g1CoZ05UpU", "\"@mclaren_lou @CampKayio @EHurleyAlvarez @chucktodd I guess that means BLM and antifa will be there ready to attack like they did in Charlottesville\"", "A #Poem on #Charlottesville &amp; #Trump. https://t.co/IvfcINGAM1", "\"@thehill Read it. He clearly stated in the press conference he owns one of the best winery's in the U.S. in Charlottesville. So he owns it or Eric?\"", "https://t.co/WJJIs78aYV  #TSGLFC #Lanz Sarah Knappik #FCHBSC Insolvenz Feiertag #dobombe Gewitter #Charlottesville Fluggesellschaft 2", "\"I've never agreed with your columns but I honestly thought you were more intelligent then this @SueLaniMadsen         What a crock of BS. https://t.co/09LbzaFckp\"", "He red pilled the fuck outta that room of lying blood suckers https://t.co/RCmiG0kk85", "I added a video to a @YouTube playlist https://t.co/SOq898xXp6 VOX Blames Trump for #Charlottesville", "@Mikey_Cyrus https://t.co/S31IypoWy4", "Donald Trump, Steve Bannon, and Charlottesville https://t.co/839pdxJdHO", "\"MLK's home was bombed. These Nazi crybabies need to realize they have the privilege of only getting threatened when they beat&amp;killed ppl. https://t.co/IGz7elAyKb\"", "\"The YDA LGBTQA Caucus condemns the terrorism, violence, and hatred seen in #Charlottesville; and remain dedicated in the fight for justice. https://t.co/0tJcuSDcsp\"", "\"@FemMaverick @KerryTweeterson @Adavazq52076447 @NewYorker He claimed shots but no police reports of shots fired. Guess felt threatened and just found a flame device. https://t.co/HT60dFJ5Lv\"", "I talked to Robert E. Lee's great-great-grandson. He denounced Nazis more forcefully than President Trump.\nhttps://t.co/STq2Mn16YG", "\"We feel empowered by the words of this @POTUS! Tommy, you should ask yourself why did your groups ATTACK &amp; RIOT in #Charlottesville ?? https://t.co/p1gKOXocBN\"", "@realDonaldTrump\n#FuckYouTrump\nMake it trend\n#Charlottesville \n#WhiteSupremacists https://t.co/q51u8eQupo", "Politics: The White House talking points on Trump's reactions to Charlottesville have a singular message… https://t.co/TdApqv3VFN", "Thread. https://t.co/w5OFxvnvDx", "CHIT CHAT LIVE DISCUSSING:  YOUTUBE AND CHARLOTTESVILLE PROTEST You gotta LOVE Diamond &amp; Silk ❤️❤️ Nails it again‼️👍 https://t.co/42SvQTWHsb", "\"Unbelievable. He is disgusting and will never be recognized as my president. HOW CAN YOU ENDORSE ETHNIC OPPRESSION??? https://t.co/ADbu2hn71O\"", "\"More divisiveness following election of traitor who owes success to Russia &amp; corrupt money laundering. A sane Prez will resolve this madness https://t.co/LQehdk7IOD\"", "BREAKING- TRUMP BASICALLY TELLS EVERYONE TO F*** OFF as HE AGAIN BLAMES \"ALL SIDES\" FOR CHARLOTTESVILLE... MAGA", "Lawmakers slam Trump's latest defense of Charlottesville response https://t.co/qGh76izSdb via @USATODAY", "The SUMMER OF HATE. #Charlottesville #charlottesvilleraceriots https://t.co/yLFzU4zPX7", "Well look at that. Suck it @realDonaldTrump \n#ImpeachTrump https://t.co/nxRlhITjL1", "@realDonaldTrump You are right about Charlottesville they had a permit the police did stop anything", "Remember her name\n#HeatherHeyer \n#WearPurpleWeds\nhttps://t.co/JzocpuSkrv", "https://t.co/zZAdPYUsa9 #cool #story #here", "🤦🏼‍♀️ this is bananas https://t.co/zpB3gL89l6", "\"@don_rondel @iceco666 @james_penrod @kwilli1046 Donald Trump, this is the type of supporter you have, Republican Nazi sympathizer. Doesn't it make you proud?  https://t.co/d9VHhMVGN3\"", "\"No, The Charlottesville Racist Douchebags Aren’t “Frat Boys” — They’re Just Racist Douchebags: https://t.co/rvBNPdJOqC https://t.co/Uh93dZWfls\"", "\"This week it's Robert E Lee...when will it be George Washington?\" \nWELL CONSIDERING HE DIDNT COMMIT TREASON https://t.co/9OnWkpH7Rg", "\"Always do the right thing.\" #spikelee #Charlottesville", "Jimmy Kimmel on Trump &amp; Charlottesville: ‘I Would Feel More Comfortable if Cersei Lannister Was Running This Count… https://t.co/0NRpgfavgc", "@FoxNews @LaraLeaTrump @SheriffClarke @POTUS https://t.co/UUItukXnsJ", "\"@Cernovich These are the people who watched the livestreams of Charlottesville. They saw it happen in real time, both sides of it were despicable.\"", "A post-Charlottesville reading list to help explain American white supremacy https://t.co/MjPKDtPw2t", "\"Even White Supremacists have their reasons to protest because they are people too. However, they must learn to do right in this life. https://t.co/tU0g0rIMmW\"", "The page has been turned, and a new chapter is opened as Donald Trump expressed his views on what happened in Charlottesville Virginia.", "Obama's tweet in response to Charlottesville attack is one of the biggest tweets ever - CNN https://t.co/DP9lpaOher", "\"What a disgusting pic Nazi salutes &amp; sickening chants in America in 2017... Makes me sick in my heart. It w be overcome by our unity in 2018 https://t.co/AbiBPJLd8x\"", "Trump defends his late response to Charlottesville and blasts the “alt-left.” https://t.co/arMH8iS1Yc", "He just served us another shit sandwich! https://t.co/5rWTW2g7c7", "@MarkDice @Claudia4Trump https://t.co/x8nSiP3qoS", "The antidote to fanaticism is modesty, @nytdavidbrooks writes https://t.co/vwnUMg3UVg", "DON’T ATTACK THE NAZIS!!!! #NazisInTheWhiteHouse https://t.co/KMjVtzuikz", "#Charlottesville Time for Trump &amp; his crew to go", "\"Does anyone know Trump owns a house in Charlottesville? He wants you to know he owns one of the largest wineries, and it's in cville https://t.co/6e1fLzEJqs\"", "\"Hey @SpeakerRyan @SenateMajLdr anything to say? Are you still hoping to take away health care and give tax breaks to donors. Lookin' shaky https://t.co/3HXi8pnhSm\"", "Watch: Antifa Starts Violence In Charlottesville, Police Directed Unite the Right Right Into Antifa https://t.co/J7KXEn29An via @youngcons", "Pretty unsettling thread here tonight https://t.co/wpBDiQUy73", "Has @FLGovScott made a statement about #Charlottesville ? Vile.", "This Vice News Documentary from Charlottesville Is Horrifying https://t.co/DFdVQxWIJf via @Esquire", "\"Trump Fan Misidentified as Charlottesville Protester Speaks Out About Death Threats, Lost Business https://t.co/QHDCHB76Pq #TDoug https://t.co/WcMqziXU2R\"", "\"Opinion: Measured reason is required regarding movement to vilify &amp; alter EVERYTHING about #AMERICA.  Public shredding of Constitution next? https://t.co/oqwEbbcg5c\"", "Hi, #Snowflakes ! Charlottesville Democrat Resigns As His Racist Messages LEAK https://t.co/RCOJMlNDDE @iamthemiho @ruthtaka @", "\"Trump 'entirely correct' to blame both sides for Charlottesville violence, White House says\" via FOX NEWS https://t.co/xbPLBCrkSd", "\"Bcuz it wasn't a train running over a CNN reporter but a CNN reporter trying to stop train. The feet were dug in picking up rail boards. https://t.co/aQylTSuwrB\"", "\"@SLandinSoCal @foxandfriends @realDonaldTrump This is disgusting and in such absolute poor taste in light of the tragedy in #Charlottesville. You should be ashamed.\"", "\"It was a lot like watching a nonswimmer shoot a Class VI rapid without a kayak,\" @jackshafer writes. https://t.co/zAUPhCNYqf", "@ShanaVWhite @CommonSense Good article fr @anya1anya https://t.co/9omd5OxlLH \n (inc Critical Media link)", "\"Helicopter rides\" is a relatively common reference point in right-wing circles https://t.co/njs1FkgTnB", "\"This is a transcript, if you experience stress while watching video (I do). But know this: it's not better written down. It's still racism. https://t.co/RmridrdaNi\"", "Kamala Harris Slams Donald Trump's 'Many Sides' Rhetoric On Charlottesville https://t.co/ZkSlsYg75D", "#DonaldTrump blames both white supremacists and leftist demonstrators for #Charlottesville violence https://t.co/kbwBey9J5V", "This is a terrorist. #Resist https://t.co/LmF8F4r17p https://t.co/hmhlauAzhS", "Robert E. Lee is already in the history book, but let's not give him a spot on the bookcover. Bring down the statue #charlottesville", "Only some slaves in india cares about what des reports talk about india https://t.co/RU5flZw16I", "113After Charlottesville, Trump retweets — then deletes — image of train running over CNN reporter https://t.co/nI6uPYFRgD", "#NEWS #SWEDEN #SE After years of not waiting for the facts, Trump blames Charlottesville vagueness on just that… https://t.co/xQOp8JYjp2", "\"@dionsemi Nazism is Un-American, we literally fought a war about it! The violent people in Charlottesville were the ones that killed Heather Heyer\"", "These are not people \"protesting very quietly the taking down [of] the statue\". https://t.co/GZvrDJk5oc", "@DrWesBellamy https://t.co/0czkOdTs9G", "Obama's tweet in response to Charlottesville attack is one of the biggest tweets ever - CNN https://t.co/qUON2w0k9E", "Heather Heyer, Charlottesville Victim, Is Recalled as ‘a Strong Woman’ https://t.co/6MxqWStzfP", "A FOX Trump-Lover Just Gave An Epic, Unexpected Response To Trump’s Charlottesville Press Conference https://t.co/gsyYegWTSX via @anteksiler", "\"@CBSNews @RepGwenMoore Why aren't you calling for removal of Mayor of Charlottesville who failed to protect citizens?Oh, cause he's a Democrat.Spare me the outrage\"", "Guys that's the trick. Keep letting get distracted by other things so he can't destroy everything https://t.co/mO8qX1u6yR", "hey republicans, how do you feel that you voted for a man who defends nazis to be your president???? https://t.co/2uMLkUQZ2A", "\"Charlottesville re-revisted: Donald Trump backtracks, repeats that ‘there is blame on both sides’ https://t.co/SINJkozkF8 https://t.co/85f9K9vGGu\"", "\"@goodbye56789 @JacobAWohl @realDonaldTrump BOTH SIDES ARE BLAMED BUT honestly, ALL RIOTS STARTED W/ HILLARY, SOROS, OBAMA! DARE TO DIE 4 THEM? #Charlottesville https://t.co/0pN7ZgV3sE\"", "\"Trump finds favour with far-right after praising 'fine people' on neo-Nazi march  #Charlottesville @Joyce_Karam  https://t.co/kBOAKTRKJN https://t.co/gpsiBIDAKP\"", "El tuit de #Obama sobre Charlottesville es el mensaje con más \"me gusta\" de #Twitter https://t.co/TMP0bmW0n9 https://t.co/21H2qpWJD2", "https://t.co/L79yyY7xWK via @TeenVogue", "I have no words. https://t.co/MizG2cuImH", "Bernie Sanders Deletes Tweets Blaming Trump For Charlottesville, White Supremacists https://t.co/dfUgGKx91L", "What #Courage looks like tweeps.  Wrong is wrong is wrong is wrong is wrong https://t.co/1pMi8lZLiN", "After Charlottesville, Trump retweets — then deletes — image of train running over CNN reporter https://t.co/0C3f3YYgUV", "This man is complicit--&gt; https://t.co/IWF6u5sfiG", "Oh God no https://t.co/ehfkTQlZaU", "Youth Vote: Trump blows up damage control as he blames ‘both sides’ for Charlottesville https://t.co/JllxFMwTia", "@GovMcAuliffe can you please give an accounting for all fund you received in the 2016 campaign. #inpeachthednc https://t.co/9Fj96VHL0P", "https://t.co/hmosgkXtoV  #SDLive #Quantico #AmericanAssassin #commentetaPP #Assomption Charlottesville Sonic Mania Sierra Leone Le 1 14", "There you have it. https://t.co/TrmVgHBSeO", "O que realmente aconteceu em Charlottesville e a essência da esquerda https://t.co/B9RW05zXjk", "@usagi_soldier Everyone's talking about #Charlottesville &amp; all the morons involved &amp; I'm sitting here being terrible at Sonic Mania", "My man https://t.co/TNKo6qvmlH", "Attend a #BlackLivesMatter vigil in Syracuse, New York with me \n\n#Charlottesville #socialjustice #revolution\n\nhttps://t.co/jOUgP9iH8O", "hOw the fUck is this cheeto puff president https://t.co/ZK1SKKdQnw", "Sir - it sucks to be you right now. https://t.co/dDFBF9garh", "No, Americans aren't satisfied... and you showed your true colors today. https://t.co/uSqp8mRVoU", "BREAKING: Charlottesville’s Deputy Mayor Has A Sick Secret – It’s Horrifying https://t.co/xM29s1qB1p", "#TheResistance #tRUMPrussia #Mueller #Charlottesville #uniteblue #demforce #indivisible #p2 #ctl #tlot https://t.co/PfMN8bu9AO", "This is a must-see for everyone. This is the enemy. All these nazi pieces of shit need to be exposed https://t.co/HJj1AXudQs", "@TuckerCarlson  This is Next  https://t.co/3lUdBidAVK", "New video by Fox News: Trump fires back at critics of his Charlottesville response https://t.co/GDq3Dj85gZ", "Les propos de Donald Trump ont été salués par un ancien leader du Ku Klux Klan présent à Charlottesville https://t.co/yO6Q7ecX9x", "RT SenSanders: realDonaldTrump The violence in Charlottesville was not caused by the \"alt-left,\" (whatever that ma… https://t.co/sYHADHG05o", "This cause is close to my heart - please sign: https://t.co/mNssHV8ZD9 via @Roots_Action", "One thing about those tables. THEY ALWAYS TURN 😌😌 https://t.co/a8xJTV3Za3", "Are those the nuclear codes in the suitcase at right? https://t.co/XfbkEAdkeY", "Thank you Mr. Presdent for your clear and concise comments today regarding the Charlottesville incidents. @realDonaldTrump @potus", "https://t.co/5tkXAPMTVv", "@BreitbartNews https://t.co/Er2VIn9Kbl", "Side note: Who let this group have a permit in the first place?????? Lolz https://t.co/U3PDiWDmM1", "\"@POTUS is right. What @marcorubio doesn't seem to get is it was the Old Nazis against the New Nazis fighting in #Charlottesville. Both 💯 bad https://t.co/PikA8YHh1r\"", "https://t.co/E5eyonN3iB", "Trump defiant on Charlottesville unrest: 'Blame on both sides'. https://t.co/b0eLa4DXKM", "\"Don't forget refusing to condemn nazism, and Implying that Charlottesville counterprotesters are equally problematic. https://t.co/zDpFauueNq\"", "Wow. @govbrewer is draw-joppingly repulsive. @cnn #Charlottesville", "Franklin Graham Defends President Trump, Slams Satan for Charlottesville Chaos  https://t.co/Kxz1k4wJ3W", "@CNNPolitics before I get trolled let me just say ..... I condemn ALL OF IT.... #Charlottesville  #shameonall https://t.co/n7GgdpEC9e", "The third guy has chosen a backwards flower penis. https://t.co/MAO808a5VY", "Social Media Update: Obama's Charlottesville response just became most-liked tweet in history https://t.co/PTvDFyn4EJ", "\"#SOCIALMEDIA Obama's Charlottesville response just became most-liked tweet in history https://t.co/UUmIcCjRXd via @mashable https://t.co/uFXd3E0wut\"", "STOP TALKING https://t.co/C0m8ucCY7Q", "\"'We have racism in this country': Springfield demonstrators rally in support of Charlottesville https://t.co/aQpbYXY71R https://t.co/A8RY4lvCxM\"", "Freudian slip. He said the left were coming at us. https://t.co/eCMuw8fbPW", "Jimmy Fallon Addresses the Events in Charlottesville https://t.co/KNMQFzornY via @YouTube", "Media Silent About Antifa Attack on Female Reporter in Charlottesville https://t.co/MSXx58imyq", "@MaasaiGunClub Check out @The1stLadyLove's Tweet: https://t.co/P0gHl3hULl", "@IvankaTrump Trump gave his daughter to a Jew.  Nice quote https://t.co/YwDEijL41A", "Violence that just occurred in #Charlottesville.  So, Sept 16th is not happening 😃😀", "NY governor pushes 'Charlottesville Provisions' to make violent protests a hate crime https://t.co/SOKssmLnjo", "RT AC360: Trump supporter on POTUS' Charlottesville violence remarks: \"What happened today was an American abomina… https://t.co/2fMy6v3Xas", "Crazy times we live in. We need peace so we can sleep at night. \"Alt-left\" #charlottesville #GeorgeWashington https://t.co/wMhpF5d8Kh", "\"@PascoRevolution Paid for by YOUR PEOPLE!  https://t.co/yKzhLT4cBV Soros spend $100m in Ukraine &amp; he’ll spend 1000x that here. https://t.co/STSlLoAk9J\"", "Is this just my computer or is Senator Richard Burr's (R-NC) comments on #Charlottesville a totally blank page?... https://t.co/m8TP3s6o43", "Essa treta de Charlottesville jogou uma merda tão grande no ventilador que eu não paro de ver informações erradas sobre o que aconteceu lá", "Batman is right! #Dolt45 #Charlottesville @TitusNation @ManMadeMoon https://t.co/4nS1ctWneG", "\"They should sue 45 too. As far as I am concerned, after this campaign, and today's rant, he is complicit. I would vote guilty. https://t.co/c0AYXLSEyf\"", "Both sides to be blamed for #Charlottesville violence: #DonaldTrump\nhttps://t.co/FTbju2m1sW", "media obsession on breaking down Trump's post Charlottesville statements has left invisible the name of James Alex Fields almost invisible", "Lmao...Trump went off script on this in under 24 hours https://t.co/R1lc7Bh7px", "They're too scared of us snowflakes to do it themselves https://t.co/7f9wgI79qM", "#embolden &amp; #abandon https://t.co/7TzG0cTLji", "\"@MittRomney IS A TOTAL IDIOT 2 THINK #ANTIFA &amp; #BLM BOTH RACIST &amp; VIOLENT GRPS OPPOSED VIOLENCE N CHARLOTTESVILLE--THEY WER MAJ PLAYERS-AH! https://t.co/G5w3cxggRE\"", "@LastWordWilliam start here for explanation and points are next tweet. https://t.co/kvv7n5YPDO", "@realDonaldTrump Get this ! https://t.co/5gQ0u5ObG7", "\"@chuckwoolery LA Times reporting violent Anti-Fa willfully engaging with racist scumbags ... pretty much what Trump said.\\n\\nhttps://t.co/SUBy3Y5CaF\"", "College Republican Attacked by Antifa at Vigil for Woman Killed in Charlottesville https://t.co/WZQ0Od4fTd", "Trump thinks white supremacists are fine people?  Holy 💩!!!  #25thAmendmentNow #FakePresident #RacistTrump #ConMan https://t.co/HtOycmUHlW", ".@KenCalvert We hope you'll call out President Trump for giving cover to white supremacists &amp; neo-Nazis. #Charlottesville", "Obama's post-Charlottesville tweet gets Twitter love - ABC News - https://t.co/9j1SWBRUuq via @ABC", "\"So are women less racist in general or do these asshats make their partners stay at home? #ImpeachTrump #QuitTheCouncil https://t.co/hl8mwvF94d\"", "\"Problem w/ this argument is it assumes all violence is condemnable. If someone is trying to exterminate you is it condemnable to fight back? https://t.co/ao9AT7fgPy\"", "That didn't turned out quite well. https://t.co/9unl4t6BBw", "@joncoopertweets #ImpeachTrump #FireBannon #FireGorka #QuitTheCouncil #Charlottesville", "\"Discord, the platform in discussion, did nothing leading up to Charlottesville. Then banned nationalists on Monday... pushing them elsewhere https://t.co/5WIWPrU26i\"", "When mnsu denounces #Charlottesville on the first try @realDonaldTrump https://t.co/24dEiEP5D6", "Every paragraph of this @tnyCloseRead piece is so good. And infuriating.\nhttps://t.co/EoqPJOtLPp", "Uhh oooo not looking good.....🤔 https://t.co/J5CoGeVTDR", "Hahaha!!!!! 😂👏😂👏😂👏😂\n#LIBERALLUNACY #LUNATICLEFT https://t.co/Apar26cBo7", "RT WebsterGTarpley: #Charlottesville reports say counter-protest was not mainly #AntiFa violent extremists but normal local residents offen…", "\"When Donald Trump literally condemned neo-Nazi's &amp; the Charlottesville incident yet people still aren't happy with him https://t.co/cnS9UPiJD3\"", "Can't run a poker face 24/7 https://t.co/lFmUNoPTab", "Maybe if you had a microscope? https://t.co/HeNBmqw5HZ", "@ThomasWictor https://t.co/XN4uGUXhaE", "\"no, no, that's not how this works. there was only ONE side that day, and that was the side of hate. #HateHasNoHomeHere https://t.co/0PK2H0MD48\"", "@8over3 @kylegriffin1 I'm pretty sure Trump didn't know Charlottesville existed until this weekend.", "Disgusting... while #Charlotteville was F'd up it was set off by Antifa and Alt-Left https://t.co/iHrjCo9If5", "\"NY Times Reporter Admits Antifa Protesters In Charlottesville Were 'Hate-Filled' And Violent Before  Backtrack https://t.co/5OIZqC93gI https://t.co/yppyoZDU1D\"", "Yes, the terrorist group who burns American flags were there to defend American values. https://t.co/owb9yIbqcQ", "\"White supremacy denies we are all created equal. Nazism= National Socialism, not conservative, crushing of human freedom. #Charlottesville https://t.co/BK1BtaSaLa\"", "Trump's Inability to Unequivocally Condemn Charlottesville Nazis May Be Rooted in His General Love of Illiberal Ex… https://t.co/e7LbvABYdW", "Trump condemned over latest comments about cause of Charlottesville violence https://t.co/mgZjHf2PAB", "Politicians react to Trump’s comments on Charlottesville https://t.co/HUcaMgq4PU", "Watch Trump's full Q&amp;A on Charlottesville \n\nhttps://t.co/S6DT1rZUtu", "Harbaugh Calls Violent Protest In Virginia an 'Embarrassment' | BSO He does not shy away from the issues of the day. https://t.co/Sz855ds3V0", "Terrifying, but true - Trump Gives White Supremacists an Unequivocal Boost via @NYTimes https://t.co/XHn0AXlsOh", "Montini: Trump panders, again, to Charlottesville neo-Nazis https://t.co/5cwc7Ha0U6 via @azcentral", "@Morning_Joe https://t.co/Ix6MttxlIw", "@MarkDice #Antifa either fooled this guy or he's part of it\nCheck this #FakeNews out!\nhttps://t.co/zDtPhiJbEp", "Obama's Charlottesville response just became most-liked tweet in history https://t.co/sXWnb0ftA4", "Lock Trump Up Lock Trump Up https://t.co/6kVxU6h8y9", "These 2 are the dumbest women you'll ever meet. @DiamondandSilk https://t.co/sZ1UsRGuiO", "Exactly! Thank you Mr. President! No permit! Both sides were in the wrong! https://t.co/KbTGtAIGSH", "I wonder if Trump has any idea what the name was of any of the 3 people that were killed in Charlottesville.", "\"¿Puedes ser Neo-Nazi y ser un so-called \\\"very fine people\\\" todo al mismo tiempo? \\n\\nEs una pregunta real. #KeepAmericaRacist https://t.co/D4bHXR9emf\"", "He wants to make the KKK that want to restrict rights equivalent to the left that wants to expand rights!!! https://t.co/oProlOQkyV", "La meuf de trump qui dit ça, en tt cas https://t.co/GjzThzKFTl", "@Rgmarcos25 https://t.co/yBYhVwJkUW", "Trump Gives White Supremacists an Unequivocal Boost, via @nytimes https://t.co/vucWjgKVeC", "@realellsworth @WWE @ShinsukeN @CedricAlexander @WWE_Ref123 https://t.co/CRfcLl63aK", "The White House talking points on Trump’s reactions to Charlottesville have a singular message https://t.co/wkCmDOfE62 #happeningnow", "Warning: graphic violence may trigger. If you can though, watch this. via @VICE: https://t.co/YCIAAw1z8w", "\"Empathically &amp; irrevocably yes! Sis, whatisudoing? @ladygaga \\n\\nOne side is saying, \\\"Pls stop killing us\\\" &amp; the other is saying, \\\"....no.\\\" https://t.co/GKw8zTp7DZ\"", "Donald Trump Has Been a Racist All His Life — And He Isn’t Going to Change After Charlottesville https://t.co/XhkUiBa6s7", "#Charlottesville \"Bad assed\" White Supremacists—brandishing PATIO LOUNGE TIKI TORCHES. LOL!", "Did the president actually say counter protesters were also to blame in #Charlottesville? As in people protesting kkk and nazis? Seriously?", "\"Not only did the police let them destroy a piece of marble they allowed them to hang their conquer flag as well, like ISAS @TuckerCarlson https://t.co/b3ZAXaEOJ0\"", "\"@LBIJEAUX @USATODAY How about U take UR ignorant POS self &amp; do a whole lot of STFU. Bless UR ❤️\\n#ITMFA\\n#25thfor45\\n#2Incompetent2BPresident\\n#Charlottesville\"", "\"We must all do so. There is a rainbow of moral consensus of opposition to the #WhiteNationalism of #Charlottesville. Thank you. https://t.co/nICkucUyO7\"", "Top Kasich adviser fr NH says would be morally irresponsible not to challenge Trump’s comments https://t.co/poeBIo6lq1 via @conmonitornews", "His own people can't stand hearing him anymore https://t.co/E1yTmqJjxK", "https://t.co/cLIXALd4W7 is exactly right there is Two sides of the story, the Nationalists did have a permit did the others?", "@dailykos Charlottesville police were derelect in their duty in not stopping violence as soon as it began. Trump needs to be replaced !!!!", "NYTimes: Trump Gives White Supremacists an Unequivocal Boost https://t.co/TarbaXsNpN", "No way! When you think it can't get any crazier, it does! https://t.co/sGjF3ZSPBR", "imagine if it was muslims people instead of white supremacists. I'm sure we would be in this same situation. #Charlottesville", "Only one year and a fucking human being late there Associated Press https://t.co/KclESz6GGS", "!!!!!!! https://t.co/9mQejwB9yU", "Peaceful demonstration he said..... @YourPalRags https://t.co/FXUC3xsg1y", "\"@RoyBlunt Pls don't go along w this. Antifa was antagonistic some, but no where near killing, hurting clergy, mobbing worshippers in church. https://t.co/kqNHpE62PU\"", "\"Just watched again.  Anyone that even begins to equate the 2 sides in #Charlottesville cannot have watched this. And they promise more death https://t.co/278jdy5sN6\"", "Gospel Traffic News is out! https://t.co/zRRBpE50Uz #GospelTraffic Stories via @PewReligion #fakechristian #charlottesville", "Well said. Too bad neither side gets it. https://t.co/PbNx9ehS8r", "Donald Trump, Charlottesville, North Korea: Your Tuesday Evening Briefing https://t.co/HWGhHp50j8", "Listen to Ep. 362 - The Aftermath Of Charlottesville by The Ben Shapiro Show #NowPlaying  on #SoundCloud\nhttps://t.co/hgDnKIUjzl", "@brianstelter @markdubya https://t.co/6X4DXhPD3u", "@L3monbarz https://t.co/4BNTuMZjKE", "#AmericanPatriot #JohnMcCain. #Charlottesville https://t.co/T45Pq4e8zD", "Trump Says There Were “Very Fine People on Both Sides” in Charlottesville – Mother Jones https://t.co/uxU36dRI3t", "Watch VICE News Tonight’s full episode \"Charlottesville: Race and Terror\" https://t.co/aZz3eblp2S via @vicenews", "#MAGA! https://t.co/mPy4xyPSe6 Trump is so right about Charlottesville, and the Silent Majority knows it!", "\"#RIPHeatherHeyer\\n#RIPHJayCullen\\n#RIPBerkeMMBates\\nDeepest condolences for fellow souls who died because of #terrorists #Charlottesville \\n2/25 https://t.co/26sSCGxVor\"", "This is fucking horrifying. More importantly, it's terrorism. \n“Notes on Charlottesville” @_ChelleShock https://t.co/mS8lGNdsGw", "@PauloELemos @thiago_pither @folha Essa é a marcha lgbt de charlottesville?", "@CoryBooker @marcorubio @SenBillNelson I've been able to find reports that only 4 people were arrested in the Charlottesville violence? Why?", "Read this. Your post-#Charlottesville energy is having an impact (more than you probably realize): https://t.co/RYl3lZ4fEl", "😂😂😂😂😂 https://t.co/hhYGAWkze0", "@mattmfm @gaywonk Exactly what Cantwell was reading in Vice's Charlottesville piece https://t.co/h94yUZydKH", "\"The most important thread you'll read today. The white supremacists left caches of guns around; Charlottesville was a dry run for genocide. https://t.co/7gCgGv1eGM\"", "I liked a @YouTube video https://t.co/cxk4Bx5zpV Breaking Crazy: Donald Trump's Charlottesville Press Conference", "🌹💐🌷🌺🌻...🕊 https://t.co/dr7QOmw2hU", "These possums look more human than half of the white supremacists in Charlottesville https://t.co/LCZtKhn2p4", "3 big mistakes Donald Trump made in his 2nd speech on Charlottesville https://t.co/aeugosB2mw #TheResistance https://t.co/7SK77iuvQy", "Lemme guess! \"white wine\" 😂😂 https://t.co/rnUuA5rBCv", "WATCH: Trump holds firm on remarks about Charlottesville https://t.co/U1Q3EdlB59 https://t.co/tGJaNxKdxy", "Jesus Christ you're a piece of work @realDonaldTrump. Grow the fuck up.  https://t.co/M4QrPHC6lL https://t.co/oE7YtpsjUR", "At least he speaks the truth https://t.co/a14rFJlhXs", "'Just No': Dems, Republicans Blast Trump's Latest Charlottesville Remarks https://t.co/fPI7ih8fkP", "\"@_kim_ho @vanbadham I agree ,angry white men are the problem . But i have not seen a single photo of Anitfa at Charlottesville,were they even there ?\"", "https://t.co/xxGqDEUuLH", "Elite mentality https://t.co/cJ4DuFVKpP", "https://t.co/7QDXnVv8M5 \"For only love can conquer hate.\" #ImpeachTrump #Charlottesville", "Charlottesville Was Just the Beginning. Here's Where White Nationalists Are Rallying Next https://t.co/Hexp9dNJWK", "Why can't anyone see that both the alt- left and the alt-right had a role in the negative events in Charlottesville?", "Gross https://t.co/ElPHfIQMNi", "\"@SenToomey @SenateGOP HouseGOP @KeithRothfus do you stand with or against @potus and white supremacist hate? Time to choose. #ImpeachTrump https://t.co/Oha6Zt74MQ\"", "@FoxNews @TuckerCarlson https://t.co/1B6To9KSvY", "\"DISGUSTING ANTI-AMERICAN COWARDICE SURRENDER 2 FACTIONS ADVOCATING SOCIALISM-COMMUNISM-'WE' NOW MUST PHYSICALLY PURGE THESE POLITICIANS🎯 https://t.co/G8jlUdxqME\"", "\"McConnell has no more soul than Trump. He'll respond, if at all, out of political expedience, not moral outrage. #Charlottesville https://t.co/xSpE1MYK5w\"", "The latest The Twitter Salon! https://t.co/MCVfdYF8aZ Thanks to @fclosetotheedge @LetsRoc137 @roxana_hadadi #news #charlottesville", "Read the complete transcript of Trump's remarks on Charlottesville https://t.co/TEvHudoyZ7 https://t.co/rmDh5KOxEh", "#ImpeachTrumpAndPence https://t.co/quFAstoKoy", "An Image of Revolutionary Fire at Charlottesville https://t.co/BQcmhAHevn #Society #World", "He don't look to intrested in his speech https://t.co/8I5vy01K98", "\"PijushDu : Obama's Charlottesville response just became most-liked tweet in history https://t.co/u0zWvtLYeS … https://t.co/UguuDAek0o) https://t.co/XLvE5SycBP\"", "Não me recordo de ver o Leo McGarry assim tão constrangido com o Presidente Bartlet. https://t.co/bTtGfPft7h", "\"Given all the press accolades given to Kelly upon arrival, will he General do the honorable thing and resign? No. The roses were undeserved. https://t.co/34B0TNAW9i\"", "I'm movin to Charlottesville. \n#WhiteIsWhright", "#Impeach45 #25thAmendmentNow https://t.co/M6t8LRmKWA", "Know Vets who were in VA.  AntiFa drew first blood Sean !!! https://t.co/YEF6iATgWI", "UNITED WE STAND Rally For Colin Kaepernick and Charlottesville in Las Vegas 8-23-17 https://t.co/4fqHS4ALfL via @@rallylists", "New post (The Shift: This Was the Alt-Right’s Favorite Chat App. Then Came Charlottesville.) has been published... https://t.co/UjvV34cVdV", "Fox host goes into meltdown mode over Trump’s Charlottesville comments: ‘Disgusting!’ https://t.co/6vxNyx8kgD via @thesarahdtaylor @theblaze", "74After Charlottesville, Trump retweets — then deletes — image of train running over CNN reporter https://t.co/nI6uPYFRgD", "\"Just wow. Racism is alive and well on both sides. Super sad 😭 and sickening 😷 Just be good Americans.    #Charlottesville https://t.co/chIufYzno6\"", "\"Listen up!! Trump is a LOSER, and the racists nazi's are also LOSERS. The nazi's LOST. The confederacy LOST. And trumpy dumpy is gonna LOSE https://t.co/53HUYNKscD\"", "Your son is a communist thug that runs with ANTIFA. Sit this one out. https://t.co/wTN6aBC7MJ", "Top Dog worker in Berkeley loses job after he's outed as Charlottesville protester https://t.co/aHpMcSBGwr https://t.co/ecqXw94tAU", "In Charlottesville, the Local Jewish Community Presses On | https://t.co/GHAzYtU91C https://t.co/LhdE9dHisz", "A prophecy fulfilled https://t.co/crboTS70kJ", "@realDonaldTrump - You SUCK at being a president. Resign!!! https://t.co/bGGxF0FO2m", "@lutherstrange Where is your condemnation of our president's remarks this afternoon? #Charlottesville", "Texas A&amp;M cancels ‘White Lives Matter’  IF WE LOSE FREE SPEECH WE LOSE WHAT THIS COUNTRY STANDS 4 https://t.co/zEAmHpL3pd via @theblaze", "Vice News just released chilling, must-watch footage from behind the Charlottesville battle lines. https://t.co/huB1ZqiXQ0 via @MotherJones", "Getting Organized in the Wake of Charlottesville https://t.co/BPknULkabr via @jvplive", "@jonroth76 @BlazingTurtle @timkaine #Charlottesville https://t.co/JGTmkYBgID", "\"We Just Witnessed an 'Act of Self-Immolation Without the Flames.\" #Trump #Charlottesville  \nhttps://t.co/Da6whPM8CQ", "\"@realDonaldTrump We take it back. Looks like #POTUS has indeed pointed the finger at those \\\"who had no permit\\\" and who caused violence at #Charlottesville.\"", "\"Tomorrow I've got a piece coming on my feelings about Charlottesville and what's been going on. In this  meantime, @TalibKweli got it... https://t.co/Co3dCTHrpR\"", "Disgusting. https://t.co/ZS064Ndnhq", "#ImpeachTrump https://t.co/PC6tbrIEeW", "\"It's now official. Trump is a Nazi &amp; his tacit approval promises both legal cover from DOJ &amp; possibly presidential pardons like w/ Arpaio. https://t.co/r9DG89voFh\"", "(Includes transcript of the presser) https://t.co/ti9ByxfTd5", "\"米国社会の分断：差別主義、トランプ政権で勢い\\n#外務省　#渡航禁止　#企業　#自治体　#学生　#大学生\\n#Virginia #Charlottesville #JamesAlexFields\\n#Trump: \\\"What are we teaching our children?\\\" https://t.co/0h36aCuuXG\"", "\"Why are these Nazis' faces being blurred? Expose them for the hateful, violent racists they are &amp; arrest them when they do harm. https://t.co/fgUbB68XoH\"", "\"One needs a permit to stand up to Nazis? Way to piss all over the graves of thousands of veterans, you detestable orange clown. https://t.co/rLP3vLmpJg\"", "\"@GeekRemix I would but there's literally too many examples. Look up \\\"Antifa Charlottesville\\\" on Twitter and Youtube and you'll see video upon video.\"", "Mitt Romney Just Gave A Bold Response To Trump’s Charlottesville Press Conference https://t.co/1mGWxTm4BK", "@RichardTrumka Thank you for your courage and support #Charlottesville", "Let's see how cowardly you can be @GOP @HouseGOP @SenateGOP \nWe'll be watching and listening.\n#THERESISTANCE https://t.co/AmBpQi2R3z", "Truth will always come out! https://t.co/HUKtejxWKF", "#Charlottesville #Durham #Resist IT'S A SHIRT!! GET IT HERE 👉 👉 https://t.co/Z0PXFqYPGl\n\nALABAMA SPECIAL ELECTION: Luther Strange, Roy Moo…", "After Charlottesville, Trump's business buddies have no excuse to stick around https://t.co/HqjLxv8R4D", "Charlottesville mayor lays blame for white supremacist violence at Donald Trump’s feet https://t.co/kZr2Boo6al", "Your trying to demonize people that stood up to nazis? 🤔😷 https://t.co/wg3IiB4r6z", "Arnold Schwarzenegger Donates $100,000 To Anti-Hate Group After Charlottesville Violence | HuffPost https://t.co/1edC3fr675", "Schwarzenegger Makes $100K Donation To Anti-Hate Group After Charlottesville https://t.co/dN4SWDvyt9 https://t.co/WkLG4q6nX0", "Another Reversal: Trump Now Says Counterprotesters Also To Blame For Charlottesville https://t.co/kMaotoQDB3", "Donald Trump Back to Blaming Both Sides for Charlottesville Violence https://t.co/sXd6hOLSY6 via @TMZ", "This is extremely hard to watch but watch we must. https://t.co/arhavGcMPt", "Gostei de um vídeo @YouTube https://t.co/V0f0eZL9fo Charlottesville - Direita / Esquerda / Liberdade de expressão", "I think you meant to say the alt-right neo-nazis came charging you idiot https://t.co/zoHdaAqF1u", "Neither the press nor many people want to know the truth. #Sad https://t.co/dkajlSfIPH", "It's tough to watch someone as smart and articulate as @VanJones68 lose it. How can we make sense of any of this? https://t.co/ObspClDWxK", "https://t.co/alMsoQk8Gs", "white supremacist is gonna have a rally soon... really hope them racist mfs don't invade campus like they did in charlottesville.", "Perfectly said! https://t.co/RXFrzhrAkU", "Friday night I will be speaking about Charlottesville", "SHAMEFUL 😠  \"The President Was Entirely Correct\": Read the White House talking points on Charlottesville https://t.co/2owE86KceZ", "@tvThirdEye CNN 6:44pm Anderson Cooper\nCNN 6:44pm TRUMP: \"BLAME ON BOTH SIDES\" FOR CHARLOTTESVILLE VIOLENCE\nCNN 6:44pm TRUMP:...", "olha sr trump o erro foi n bater mais\n\n⚡️ “Trump diz que 'há culpa dos dois lados' em atos de Charlottesville”\n\nhttps://t.co/uIzvNV8ngm", "How Trump's Charlottesville response emboldens white supremacy https://t.co/uD00NzdHRH via @YouTube", "Trump Just Went On A Wide-Ranging Defense Of The Racists In Charlottesville And Confederate Monuments https://t.co/6hd9FnOg1Y via @bri_sacks", "About damn time. https://t.co/usvp0dYBwT", "Donald Trump's failure in Charlottesville wasn't political -- it was moral @CNNPolitics https://t.co/Nukkx03Q0C", "Love this guy!!! 😍😍😍https://t.co/1PcdhZ4Tk2", "BUSTED! CNN caught LYING about Charlottesville (wow!) https://t.co/f380PnLgEr via @ReadTheHornNews", "Here are the Confederate memorials that will be removed after Charlottesville https://t.co/lUeymLD9R0", "Another Trump council member quits after statement on Charlottesville https://t.co/M1eHOs3fbT https://t.co/6xaFelUB5A", "Trump Defends Initial Remarks on Charlottesville; Again Blames ‘Both Sides’ https://t.co/LYlBSxVqin", "\"Which Statues are NEXT??\" Tucker Issues Warning after Charlottesville https://t.co/zbRtmrdYcF via @YouTube", "We should only have to hear \"Merry Christmas\" wishes in Dec, so Jewish kids should have to see Nazis IRL. #Charlottesville #ImpeachTrump", "\"@G_the_Examiner You're really a brave soul. It takes great courage to be point out the obvious. Evil is bad, you say? #charlottesville #maga #trumptrain\"", "New Thread 👇👇👇 https://t.co/Gcr3lHPR6e", "\"I had no idea he lives in Charlottesville. This man's passion is so pure and inspirational.  He is a national treasure.  God bless him. https://t.co/uhCf2l3012\"", "@VICE after seeing a clip from your recent episode on #Charlottesville on @CNN it was chilling and more terrifying than anything I've seen.", "Michael Moore and Followers Challenge Trump and Trump Towers Post Charlottesville | Follow the Buzz DryerBuzz –... https://t.co/Bt8KsEtLbT", "\"@SpeakerRyan Another peaceful Antifa protestor with a homemade torch ! President is 100% right to call out both sides. https://t.co/odUWccpCDW\"", "\"\\\"Both Sides\\\"  \\\"Lincoln Memorial\\\" \\\"Groups in Charlottesville\\\" \\\"Alt Left\\\"  #QuitTheCouncil  #ImpeachTrump #MAGA #CNNIsAntifa https://t.co/QVtBmRS0bi\"", "RT PhxKen: Federal Civil Rights Probe Launched Into Fatal Charlottesville Crash https://t.co/pnWrvdRKpj  BLM NO PROB MUSLIMS NO PROB WHITE…", "Show the people of Charlottesville - and those that seek to divide - that we will not stop fighting for each other http://www.gayfrien...", "\"Fuck........fuck....fuck...what'd you ask....fuck.....fuuuuuuuck, fuck fuck fuck fuck fuck fuck Jesus Christ.\" https://t.co/nyXE8AxmEQ", "Terrorist Who Beat Deandre Harris With A Pipe in Charlottesville Found On Social Media. https://t.co/V9wlI6sGOa", "\"It's not about race, it's about class inequality\" is a classic red herring that primites #WhiteSupremacy STFU #Charlottesville", "Did he know this Q&amp;A would go bad..? https://t.co/tvE0w849RH", "\"米国社会の分断：差別主義、トランプ政権で勢い\\n#外務省　#渡航禁止　#企業　#自治体　#学生　#大学生\\n#Virginia #Charlottesville #JamesAlexFields\\n#Trump: \\\"What are we teaching our children?\\\" https://t.co/nNLA92SHDZ\"", "@ElectFYD @FlaDems @Orlando_DSA hope you aren't missing this https://t.co/OFtg5BSXt3", "Fucking insane. Oh. My. God. https://t.co/TPoy1KwQFI", "Watch as Kelly traces where his life went wrong. https://t.co/aofNwm6Gnz", "Trump’s rhetorical ricochet on Charlottesville highlights basic truths about the president… https://t.co/csDQDMvmrZ", "Oh my days..\n😐😐 https://t.co/pN8TZNkAq0", "RT FoxNews \"'I Guess It Depends on What is Hateful': TuckerCarlson Debates Writer on 'Hate Speech'  #Tucker\n https://t.co/0WAEAHRSNh\"", "#TrumpMustGo . Trump’s rhetorical ricochet on Charlottesville highlights basic truths about the president https://t.co/ibJaYf487h", "Aqui se acaba la posibilidad de que sea un error lo que dice. Este hombre es un peligro. https://t.co/Is94VnQKLJ", "Bernie bby u r the only light in my life https://t.co/EYYMCxFFla", "\"Melania Trump              Obama’s response to Charlottesville violence is the most liked tweet in Twitter’s history. https://t.co/VGZhuuQ2y0\"", "Keep in mind all of the bullshit happening in Charlottesville, VA.\nAlso, we currently reside in VA.", "I'm watching clips of #Charlottesville in disbelief of the violent hateful rally.  @realDonaldTrump what r u doing to the US? Just resign 🖕🏼", "The left needs to learn their history https://t.co/WCIClnp7zU", "Turning into a real battle of the bots. https://t.co/Pfoeaul7iJ", "Fox host: Trump comments 'one of the biggest messes I've ever seen' | TheHill https://t.co/nZmnzqHjh0", "https://t.co/Bc8Be5mZbo", "LeBron James called for love and change in response to Donald Trump's remarks on Charlottesville - @SBNation https://t.co/IxNHtc6z3t", "\"I threw up watching this. I really didn't know that this kind of hate existed in my country. Trump defended them today. #ImpeachTrump https://t.co/zjhzzO5wXj\"", "Or to protect your town #Trump wants you to have a permit...yea right https://t.co/zYqBmy0fkq", "\"I Went to Charlottesville During the Protests. Here’s What I Saw.\"          https://t.co/vwWQiBnzDv", "\"@Nazi_Catcher @MoCo_DSA its crazy that durham police are already doing raids but charlottesville pd cant seem to find a single one of these guys\"", "Racism will never stop as long as there are races that think that they are the superior of any other race in the world... #CharlottesVille", "#Charlottesville Waste of time \"Anit-protesting\" now people have died because of it. #SAD Nothing got solved, no difference was made. #PRAY", "President Trump Blames All Sides in Charlottesville – Turning the Tides of Communism’s Subversion i #Christianity https://t.co/q0UEgpBcFX", "\"@FaithGoldy knocked it out of the park with this video! \\n\\nWhen we fail to see all sides of the story, we commit a grave injustice to truth. https://t.co/hbjsoeUv8i\"", "Van Jones on Trump's Charlottesville remarks: 'I'm just hurt' - CNN https://t.co/BoHBFAABk2", "Hit 'em where it hurts. https://t.co/C7wX2kjw6m", "Nancy Pelosi calls on Trump to fire Steve Bannon after Charlottesville violence. #D16 https://t.co/triSQ3VLnj https://t.co/cCu4BEDfnO", "\"米国社会の分断：差別主義、トランプ政権で勢い\\n#外務省　#渡航禁止　#企業　#自治体　#学生　#大学生\\n#Virginia #Charlottesville #JamesAlexFields\\n#Trump: \\\"What are we teaching our children?\\\" https://t.co/ZPpZzPEBoG\"", "Was dem \"Attentat\" in Charlottesville vorausging https://t.co/3UnAjM0YME", "So @GOP, are y'all going to toe the party line? #SayNoToNazis #ImpeachTrump https://t.co/AL0eqS9XeV", "Barack Obama's Charlottesville Response Is the Second-Most-Liked Tweet | Billboard #SmartNews  https://t.co/0tapeNjzzo", "RT bi_politics: Sen. John McCain + top GOP leaders are roundly condemning Trump’s equivocations on the deadly Char… https://t.co/XpN7uM10o4", "I recognize the privilege I hold in society as a white person, but no one can make me feel guilty about Charlottesville", "\"Please tell me there are more sane people out there. RETWEET PLZ!!! #ImpeachTrump #Impeach45 #Trump #maddow #Charlottesville https://t.co/6U4UABLRtP\"", "The left honestly thinks that Charlottesville was only the right, they think it's okay their side came and clashed and caused havoc", "After Charlottesville attack, Trump retweets meme of train running over CNN https://t.co/PU4ftdbmkR", "@DTheKingpin @TheRickWilson https://t.co/9JXuDMlw7G", "@SenSanders @BernieSanders  U stupid fukking douche!! U bear more responsibility for the baseball shooting than Trump for Charlottesville!!!", "https://t.co/aFXjj3kyUy", "RT ⬇️ This video needs to go viral https://t.co/VEOq2cMMDI", "\"@am_raydio @BigNordicMan If they did that you could bet your ass I'm using the last of my money to fly to Charlottesville and go die fighting some nazis\"", "Not false https://t.co/ZT6eFecEqi", "@FoxNews @SteveDaines What do you have to say about the president's recent comments about Charlottesville, Senator Daines?", "https://t.co/AFEsXAbxL4", "#AmericaFirst #GOP #charlottesville #Pride #BloodAndSoil #Freedom  #tpp #2a #2a #tgdn https://t.co/eWlMkxyRrz", "\"\\\"Both Sides\\\"  \\\"Lincoln Memorial\\\" \\\"Groups in Charlottesville\\\" \\\"Alt Left\\\"  #QuitTheCouncil  #ImpeachTrump #MAGA #CNNIsAntifa https://t.co/wTn3KoRqd2\"", "\"The mother should tell him he is a disgrace &amp;she doesn't accept his condolences because he lacks sincerity, dignity, empathy, &amp; decency https://t.co/hqeNn1vVLJ\"", "This is incredibly sad. It's amazing there wasn't a mass murder but these horrible people aren't done https://t.co/OCgJRUGL3m", "Right https://t.co/23XuTPtgPM", "Thread. https://t.co/jWPnC9w8MC", "It is very likely he believes she deserved it. https://t.co/gK98Vh77nX", "@KeithOlbermann Trump can continue the Charlottesville charade as long as he wants. Mueller's still at work &amp; the GOP is leaving Trump.", "@realDonaldTrump @pnehlen   https://t.co/7bt2l42r17 SO SICK OF RYAN DIS-RESPECTING THE PRESIDENT-VOTE Him OUT~VOTE FOR P NEHLEN (R)", "@realDonaldTrump Perhaps you could replace these CEO's with some of the \"fine people\" representing the alt right in Charlottesville...", "Lots of others have shared this Vice video on Charlottesville.\n\nhttps://t.co/fbGCuAGGK2", "There's no doubt in my mind that certain people in the White House helped organize the events in Charlottesville and wanted this to happen.", "Fox host: Trump comments ‘one of the biggest messes I’ve ever seen’ https://t.co/OJJAkA2bWp", "\"We are NOT America when we have sympathy for those who support the extermination of 4 mill Jews,&amp; countless million blacks. Makes me sick. https://t.co/mJXlX2Bu1g\"", "😭😭😭😭😭😭😭😭😭😭 man this is some serious love like THIS is a man. https://t.co/PzTljGy36b", "Trump 'entirely correct' to blame both sides for Charlottesville violence, White House says\n https://t.co/XfuY1VJQcb", "Police: Charlottesville Was ‘Inside Job’ To Ignite Race War https://t.co/iOf8PfgrKb via @YouTube", "\"@steveal83 Both sides? There's only one side. The Nazi side. @jimjefferies responds to the events in #Charlottesville. https://t.co/UOMF7ugfJz\"", "Them whites folks ain't crazy not in norfolk at least https://t.co/wg5qO89gOB", "\"Jason Kessler ID By of all Groups The SPLC as the Organizer of Unite the Right, and Was Left Wing Organizer of Occupy Wall Street\\n#OBAMITE 👊 https://t.co/PQCX38sbYg\"", "\"I'm a right leaning moderate and the way our President somehow justifies alt right disgusts me. @MikePenceVP must replace @realDonaldTrump https://t.co/cEltWMizgf\"", "I couldn't agree more! https://t.co/OLMhz1Tds4", "#TrumpRussiaCoverUp #LockThemAllUp #TrumpAmerikkka #ImpeachTrumpNow https://t.co/WQhyTVbbrJ", "Watch this horrifying Vice documentary about Charlottesville https://t.co/jwspKaN5dX via @TheAVClub", "\"#ImpeachTrump's an unhinged trend reflecting gross ignorance,hatred and misinformation;Tucker Carlson should say so;Forgot'bout #Russiahoax? https://t.co/zeKEnItONs\"", "Obama's Charlottesville response just became most-liked tweet in history https://t.co/KMS4WnE43P", "$3 million lawsuit filed against organizers of Charlottesville rally https://t.co/lPrNEvKci3", "Trump says ‘both sides’ to blame in Charlottesville violence https://t.co/dElIuqfZ14 via @WSJ", "\"HOT DAMN 💥 RACIST VICE MAYOR OF CHARLOTTESVILLE RESIGNS! WE KNOW WHAT YOU DID! \\n\\nCopy: @realDonaldTrump @SebGorka @KellyannePolls @timkaine https://t.co/j4NQW1TcPq\"", "@capecodwriter https://t.co/46iapyZc6G", "The Nazi enablers in the WH were ok with working for a Nazi so long as he kept his Nazism sub rosa. Pick as side. https://t.co/swPLHpqxpR", "Flinches or mini strokes? https://t.co/ZRRfM8Gl43", "Trump ve \"culpa de ambas partes\" en acto racista de Charlottesville https://t.co/pQYvsCDYPJ", "@yashar Racist Charlottesville Marchers Not Happy Trump's Transportation Secretary Is Married To Senator McConnell", "\"@Dons_Johns aka potty mouth #realdonaldtrump should shut up regarding his support for Radical #AltRight Terrorists!#Charlottesville @FoxNews https://t.co/Fo9Vqi7wcT\"", "@BarackObama Please help...and be the calm that the country needs, that Virginia needs, that Charlottesville needs.....", "Trump wants to give white nationalism a chance? https://t.co/GTYiPG7a2Y", "#charlottesville #hatehasnoplacehere #myhome              https://t.co/0TodVrVsiE", "As the daughter of a Jewish father &amp; Black mother I'm deeply troubled by these acts of hatred. #Charlottesville  https://t.co/lXeBN2UdSr", "Lawmakers slam Trump for laying 'blame on both sides' in Charlottesville rally:  https://t.co/Tuq3zhr2bi https://t.co/9nqq2yjoOs", "North Korea \"Fire and fury\" ... Charlottesville \"on both sides\" ... Trump's approval rating keeps rising... 2020, four more years?", "This Fox News host roasted Trump over his Charlottesville response. It's a must-see. https://t.co/yFkPoldcfm", "61After Charlottesville, Trump retweets — then deletes — image of train running over CNN reporter https://t.co/iWs69a1LmG", "TRUE words by (R) @JosephPinion on @AC360 :\"Donald Trump, our @POTUS is impervious to #SHAME\"~ @AnaNavarro  @VanJones68 #Charlottesville", "President Trump Again Blames 'Both Sides' for Charlottesville Violence.  Pres Trump on target and right again. https://t.co/X6Wb59xgxP", "Says the Nazi.\n#ImpeachTrump https://t.co/BrxFtRrRyo", "The Late Show @StephenAtHome \nhttps://t.co/XUlFbEOT0Y", "Seth Meyers Reacts to Trump’s Latest Charlottesville Press Conference https://t.co/I2Mr7fTP8s", "This Vice News Documentary from Charlottesville Is Horrifying https://t.co/55h1INpXsm via @Esquire", ".@CampbellSoupCo says they care about racism, just not enough to #quitthecouncil. #Charlottesville https://t.co/EvjW8mX6ze", "Bet your Trump https://t.co/yXP2OUMONS", "This is cringeworthy, but unfortunately necessary to be watched in full https://t.co/TenLLpcnx3", "Hannity: Trump couldn’t have been clearer on Charlottesville https://t.co/5hJGqHbLCO https://t.co/m64YF3OFLW", "Charlottesville called for the President to affirm his affinity for his nation over his obsessance with himself, and he failed #ImpeachTrump", "\"\\\"You ain't see nothing yet.\\\"\\n\\nAn incredibly painful and terrifying watch. Highly recommend. Very well done @vicenews #charlotesville https://t.co/c7X4pVgG5V\"", "Can the American Public #ImpeachTrump ? If possible we should unite against a common cause. #Charlottesville #POTUS #NotMyPresident", "thehill: Dem lawmaker demands Trump be removed over Charlottesville response https://t.co/sDrLdEy8S5 … https://t.co/2BoflibjNg", "\"This is Charlottesville\" -Resident #Charlottesville: Race and Terror – VICE News Tonight on HBO https://t.co/LcKJF7dfVA via @YouTube", "America’s Highest Ranking Marine Just Blasted Trump’s Charlottesville Response - https://t.co/ety9VFyEYf", "\"#ImpeachTrump Clay Aiken Just Broke The Internet With His Response To Trump’s Charlottesville Presser https://t.co/H9Dx8Vb84Z https://t.co/7q3EabSU6S\"", "\"@SenJohnMcCain Very curious the airbags didn't deploy in #Charlottesville and the man photographed driving wasn't the one arrested https://t.co/dUMM0NkHp8\"", "You can't tell me Sean Hannity didn't explain #Charlottesville to trump.\nHad to have.\n#Resist", "Racism runs deep with the #Trumps. No wonder @realDonaldTrump refuses to take a hard stance on #Charlottesville #fdt https://t.co/5sqsZ5zjzr", "@POTUS was a freaking Boss today.\n\n Owned the room, the reporters, and the building. Cause, well, he does... 😉🤣\n\nhttps://t.co/UJ57V8FZWo", "Obama’s response to Charlottesville violence is the most liked tweet in Twitter’s history https://t.co/ALjUJEboy6", "RT BenjaminEnfield \"Sheriff David Clark Says He Is “Proud” Of President Trump’s Charlottesville Response! https://t.co/wje7hOb5q2\"", "\"If surrogates do this, we must respond in unison &amp; immediately to each &amp; everyone.  Response? #BothSides #Charlottesville https://t.co/tD68iLqHT4\"", "Lol!! Keep licking Trompos ass https://t.co/Vmj9tqDrPo", "I stand with anyone who condemns #racism &amp; #bigotry, but anyone who physically attacks it MUST be arrested! #Charlottesville #AltLeft", "How US Mayors Are Responding to Charlottesville https://t.co/EFGoLgIkUj", "💡💭\n 🤔😡🇺🇸 @realDonaldTrump #endthefed #freepalestine #Charlottesville #hillaryforprison2017 https://t.co/4lfuN9jG6k", "BAhahaha @drdavidduke  You are so tiny and little of a person,not even a man. How embarrassed your family must be. https://t.co/G5do5VWykw", "\"@mrmedina Ignorance. Trump is as responsible for Charlottesville (etc) as Sanders is for the shooting of a senator. This isn't unity. https://t.co/GePK5KNmx6\"", "From yep to wut? In under 60 seconds. https://t.co/C9flDHQc7r", "Líder de KKK alaba a Trump por \"decir la verdad\" de Charlottesville https://t.co/sSZiOtrkAC", "\"This is something I spoke with Nash about in June—whether he'd like to speak out politically more often https://t.co/fezuE2WxJ5 https://t.co/gumRg2nYUP\"", "#ImpeachTrump Este maligno ser motiva y reivindica el odio, la violencia y la perversión en USA.No se lo permitamos. https://t.co/YX1tk1Il3a", "Obama's Charlottesville response just became most-liked tweet in history - https://t.co/LYid6FlRLq", "@SenateMajLdr @LindseyGrahamSC @ChuckGrassley These are your supporters. #UniteTheRight #Charlottesville 👇🏽👇🏽https://t.co/J31ycU3E5T", "But on a serious note, #Charlottesville was bound to happen because the minority wanted some more equality.", "\"@samsanders @NPRItsBeenAMin It's not on you to bring white ppl (like me) into this conversation about race and #Charlottesville but do think that many will benefit 2/2\"", "With new remarks on Charlottesville, Trump leaves himself isolated https://t.co/fjTNeDj5ox via @WSJ", "🙄🙄🙄 https://t.co/QZBYPJlFRC", "Top Christian Leaders Decry Charlottesville Riots as 'Rooted in the Demonic' https://t.co/k8B98nloxU via @Ministry_Today", "Someone tell Senator Booker!!! https://t.co/1wVcZD1jOF", "Y the same people making light abt racism &amp; antisemitism in Charlottesville with their \"where's the clit\" memes also calling themselves SJWs", "#DonaldTrump been racist ladies and gentlemen... #CNN #Charlottesville  \n#WhiteSupremacist", "\"\\\"Inciter definition, to stir, encourage, or urge on; stimulate or prompt to action: to incite a crowd to riot.\\\" https://t.co/X8DbCoD2n9 https://t.co/VDzdc8NLhc\"", "#standagainsthate #WeCannotGoBackward https://t.co/YitdcwYGhE", "SenSanders: The violence in Charlottesville was caused by Neo-Nazis and white supremacists attempting to spread th… https://t.co/pTbQH4iI2j", "Amazing https://t.co/brLj9yoADU", "\"Hook us all up with the rock you've been living under. Sounds cozy and quiet and out of touch w/reality... book me a room. #AltLeft #Trump https://t.co/CTvjofv9WF\"", "FOX News Host Just Gave An Unexpected Response To Trump’s Charlottesville Meltdown https://t.co/2IPhlvLJ5M #impeachtrump @realdonaldtrump", "Reddit bans a subreddit after uproar led by r/AgainstHateSubreddits, and Facebook bans several group pages after… https://t.co/LjgIwmJck0", "Trump blames \"both sides\" for Charlottesville #D16 https://t.co/uGvcTDRGxq https://t.co/EcvnLqp5z1", "\"@realDonaldTrump You R fighting criminal enterprise (mafia). Bring in all new people like Bannon. X-McMaster, X-McCabe, XXXXXX rid each dept https://t.co/2uzOx0gboo\"", "\"@reverend_elli @SenatorCollins @SenatorBurr @DevinNunes @ConawayTX11 @SenJohnMcCain @LindseyGrahamSC @marcorubio @tedcruz @SenateMajLdr @JohnCornyn @newtgingrich @KateBolduan @SenTomCotton @CNN @jaketapper @andersoncooper @wolfblitzer @BrookeBCNN @ErinBurnett @NancyPelosi @SteveScalise @SpeakerRyan @realDonaldTrump @SenBlumenthal @SenSchumer @GOP @karenhandel @ScottPelley @donlemon @TGowdySC @ChuckGrassley @PaulBegala @RonWyden @Acosta @PressSec @DarrellIssa @SenMikeLee @DeanHeller @SenRonJohnson @SenSanders @SarahHuckabee @GovMikeHuckabee @JoeNBC @lisamurkowski @SenDeanHeller @JeffFlake @KirstenPowers @Merck https://t.co/prwEjtfqf6\"", "Why is this POS not in prison right now? @GovernorVA you suck. https://t.co/qHSpMnRcrD", "*insert CURB YOUR ENTHUSIASM closing theme here* https://t.co/CDYnd18f20", "Trump Gives White Supremacists an Unequivocal Boost, via @nytimes https://t.co/IMEwSGvutn", "Thank you yet again Susan Sarandon for speaking compassionate truth &amp; reality🔥Great perspective ! https://t.co/RptFQ3J7eG", "@realDonaldTrump : \"I know a lot about Charlottesville...I own actually one of the largest wineries in the United States\" shameless huckster", "\"This is absolutely terrifying. Thank you @VICE for putting this out. These people must be stopped without the violence they want to inflict https://t.co/qyC2Ok9qnR\"", "Thread; our thoughts are with you, Tyler. https://t.co/Mqn6NP2gZe", "That's ❤️ right there https://t.co/W9b2AVNDkA", "@Senate @Congress @SpeakerRyan Here’s How Republicans Reacted After Trump (Again) Flip-Flopped on Charlottesville https://t.co/I35eHBHJXG", "\"If @JNJCares opposes racism &amp; the #AltRight views of @POTUS @realDonaldTrump then #AlexGorsky must #QuitTheCouncil  #Charlottesville #MAGA https://t.co/5x13ZVguqN\"", "@SpeakerRyan https://t.co/Ix6MttxlIw", "LOL!!! New meaning for #NaziSympathizer or #Altright Sympathizer: Anyone who dares question the #DNC group think regarding #Charlottesville", "Raaaaaaaaaaacist! https://t.co/yEE81WrxjP", "Trump Blames ‘Alt Left’ for Charlottesville Violence https://t.co/HPjInhkboQ via @thedailybeast HE IS CRAZY!", "A GOP source says WH issuing messaging memo tonight urging surrogates to say both sides acted inappropriately in Charlottesville. …", "#marvellous997 Lawmakers slam Trump for laying 'blame on both sides' in Charlottesville… https://t.co/vvs5ou2HVY", "Establishment Media 'Shaken' by Trump Press Conference Comments on Charlottesville https://t.co/8Opu8D5MtB via @BreitbartNews", "I liked a @YouTube video https://t.co/0y9klK17QF YOUNG PHARAOH- CHARLOTTESVILLE VIRGINIA RIOTS!", "This happens when you vote based on what he says rather than his character. Speeches can be fixed. Character can't. https://t.co/hSXkVplWmD", "Trump Defends His Late Response To Charlottesville And Blasts The “Alt-Left” https://t.co/0y0cLQtAw5", "Get some rest #resist-ers... we have so much more work to do tomorrow. #TuesdayThoughts #ImpeachTrump #Charlottesville #TheResistance", "\"@gracels @pink_lady56 @ThePeoplesCube I'm not saying it happened in Charlottesville but the screenshot of the deleted article you posted was from January 29th.\"", "\"Charlottesville : des internautes dévoilent l'identité des militants d'extrême droite __ Source : https://t.co/PZ315N6YbH https://t.co/Blxeuxangi\"", "\"@briancolligan (2) I know Trump would rather discuss Charlottesville than Russia - because he has nowhere to hide on Russia - he feels the heat there\"", "Obama Charlottesville tweet is now the most liked ever https://t.co/XMGZglj9NZ via @USATODAY", "Via @CNN✔️ On Charlottesville, Donald Trump failed America https://t.co/SzqiVB2Xoj #CNN #BreakingNews", "Of 👏🏻 course 👏🏻 he 👏🏻 is 👏🏻!!!!!!!!!! https://t.co/ugTuUeMSN6", "USA: Trump's heated remarks to Reporters concerning Charlottesville | 15 min Wash Post video https://t.co/TBqrKSJBwu https://t.co/UDBbvfTWiC", "@AceofSpadesHQ Rubio blamed the radical right - 100% for Charlottesville.", "this whole situation is so sad to me https://t.co/UvMkE8MTQm", "Charlottesville driver threatened his mom with knife and lock her in the bathroom  https://t.co/iTZa1TarUh It was a Dem rally pd 4 by Soros!", "Are you really backing up what POTUS said about Charlottesville today! David Duke does!Can you get any lower? Your silence speaks volumes!", "\"@RobbieRohde @scrowder They're not based off killing. They're based off the idea of an aryan race superior than others. There were fights in Charlottesville\"", "And the #Anti-Fa mimicking #ISIS  \nare sweet little dumplings. \nGotcha. https://t.co/efy6lRXWrJ", "Yes! #khizrkahn https://t.co/nUQDjHSBIu", "Republicans' willingness to criticize Trump after Charlottesville is very bad news for his (cont) https://t.co/x5CyiXSlD8", "Ya don't say? https://t.co/iMX0PjpdLy", "@DNC using Bots to promote their hate and Violence on Twitter!! #Scum #Charlottesville  #MAGA 🇺🇸 https://t.co/UFrJrGCdsj", "Wow! Ok America, if you are not against him, then you are with him.#Charlottesville #Trump", "@Khanoisseur https://t.co/9JXuDMlw7G", "\"米国社会の分断：差別主義、トランプ政権で勢い\\n#外務省　#渡航禁止　#企業　#自治体　#学生　#大学生\\n#Virginia #Charlottesville #JamesAlexFields\\n#Trump: \\\"What are we teaching our children?\\\" https://t.co/2HHVuBX1qK\"", "NYTimes: Trump Gives White Supremacists an Unequivocal Boost https://t.co/pBD83vRcXJ", "Donald Trump is offering comfort to racists and extremists https://t.co/glQxqbP3ET via @voxdotcom", "@samesmail But I have a huge winery in Charlottesville. Great place.", "Fox News Just Asked A Photographer For His Charlottesville Images. His Response Is Epic - https://t.co/rrcOUiY577", "\"@DerpyDrakon @app_rj How many folks did antifa kill at Charlottesville? Trump was referencing this specific incident, even the video. That's what this is about\"", "See @realDonaldTrump , it's easy. https://t.co/OfzaKC1gQg", "@GilaGal @allainrick @TwitchyTeam Because people are sick of seeing #Charlottesville &amp; Seattle happen. \nLefts violence led to deaths now.", "Latest: Is hate speech free speech, even post-Charlottesville? https://t.co/KpxvwATYaV", "\"frank ocean copywrited the colour orange in 2012 who is this ugly ass irrelevant wanna be cheetoh flop in my tl. blocked. https://t.co/7mme9NibJI\"", "Where was your son !  Masked rioting w BLM OR ANTIFA ?\n\n#SchoolPlay FAIL #StandDown \nOn @GovernorVA https://t.co/N2F5JEBVN3", "O dia que os racistas saíram das redes para as ruas. Papo Negro sobre o que adonteceu em Charlottesville. https://t.co/PnSRt3FrOP", "RT CNN \"A public memorial service for Heather Heyer will be held Wednesday morning in Charlottesville, Virginia… https://t.co/PYprjvBLgX\"", "\"@VanJones68 Your words are inspiring and needed. So happy to see such wisdom and calm as you speak about the dangers of @realDonaldTrump https://t.co/siCU1HPxJR\"", "Lincoln Memorial Sprayed With Paint, Profanity Days After Charlottesville Protests - https://t.co/opQkxZF0lB via https://t.co/fEA2OUKEww", "\"@SenatorTimScott @LindseyGrahamSC You and Sen. Graham could redeem SC's secessionist past by starting #ImpeachDonaldTrump now in response to #Charlottesville\"", "\"@DemSocialists thank you antifa, DSA, and other groups @Charlottesville for protecting peaceful counter protesters and city. Well done. https://t.co/vdkb2IpCTS\"", "\"@DrWesBellamy:  Explain? I also know people in #Charlottesville claiming you pushed the violence on Saturday and demanded statue removal https://t.co/uIu5SBVH9I\"", "this fucking guy ffs https://t.co/5bPG44T1bx", "Republican \"leaders\"?  It's your move. https://t.co/LhuTrzKyHA", "Hannity: Mainstream Media Using Charlottesville to Smear Conservatives | The Sean Hannity Show https://t.co/oGeDRcc8Kr", "From the mouths of... former KKK Imperial Wizards... https://t.co/p3tLY1D3uF", "@GOP #Charlottesville #LoveTrumpsHate https://t.co/aGmuvB8Ykg", "Well said @LateNightSeth .... well said! https://t.co/RpxWsyTG56", "The latest The New Century Daily! https://t.co/uiZGOZBIbL Thanks to @kristymcampbell @IanHanchett @greta #charlottesville #trump", "#ImpeachTrump #Charlottesville #FightTheRight #FuckNazis https://t.co/eGWOrofa98", "#ImpeachOrResign https://t.co/0QQwbNHtlp", "Protesters said destroying the Durham, N.C., monument was their response to Charlottesville. @LeonedaInge reports: https://t.co/9EQF8hXAmG", "@IvankaTrump you should be ashamed of your father #Charlottesville", "Chelsea Clinton Just Gave A Classy Response To Trump’s Charlottesville Press Conference Today https://t.co/ms533X1L9q", "\"@sarahkendzior @boogieordie Considering how many people were \\\"shocked\\\" by what happened in Charlottesville, it's safe to assume many have been living under rocks\"", "The Fuhrer https://t.co/VjzhWZyMqr", "Establishment Media ‘Shaken’ by Trump Press Conference Comments on Charlottesville https://t.co/PdA3OrKzxd https://t.co/WWay1ehDTH", "Disgraced. They rehearsed these specific responses. Shame. https://t.co/KleOZo7Xv7", "Trump Gives White Supremacists an Unequivocal Boost via @NYTimes https://t.co/1lf2frp2rp", "PASSANDO A MÃO NA CABEÇA DE NAZISTA HAHAHAHA ERA SÓ O QUE FALTAVA @cauemoura SE LIGA https://t.co/FyUtxqmi3C", "\".@IvankaTrump @jaredkushner one day your children will ask why grandpa was nice to the nazis. What will you tell them? https://t.co/tyjoUJAF6W\"", "Crowdfunding sites disallow campaign for Charlottesville murder suspect. - Good for them. https://t.co/e8ZGHsqDv6", "Apparently a Detroit Lions-esque logo showed up on a shield in Charlottesville. The team has issued this statement. https://t.co/ZsnT371l29", "\"@realDonaldTrump You had one side shouting at the other and the other driving a vehicle into the first group!!!!  This is not comparable https://t.co/hByc076P7m\"", "Donald trump had to take a xan for his comments about the Charlottesville situation. Man blames both sides like wtf.", "Trump defiant on Charlottesville unrest: 'Blame on both sides'\nhttps://t.co/WPtyBjQ1HD", "@timkaine hey buddy how is your son doing in jail part of that #AntiFa violence #democrat https://t.co/K2GW1xg5sP", "Certainly not out of the realm of possibility.... https://t.co/lbEVRxJWoE", "Watch this whole thing. https://t.co/uvq7vF8cpa", "College GOP Prez Busted at Charlottesville Rally Says He’s Being Smeared: ‘They Have No Proof I’m a Racist’ https://t.co/Svl1IMmCHZ", "Know you can't Count on Police or President. https://t.co/9FzoJ7ixyi", "Surprise surprise... https://t.co/UujauHTKdH", "1927年のKKKの暴動でトランプの親父は逮捕されｗ\nhttps://t.co/OORSyZZh86", "\"We cannot go back\" https://t.co/WSnTlDe8Tx", "RT bfraser747: The only colors that should matter to Americans are RED WHITE &amp; BLUE\n\n#Charlottesville #MAGA https://t.co/Vla9xbeMjh", "They won't ever learn. https://t.co/JJkvYglY7U", "This is insane! https://t.co/pv5xCbLGg7", "Somehow Twitter \"lost the tweet \"\n😆😉 https://t.co/u3nxhVSNXD", "Read: a full transcript of Trump's remarks defending the Charlottesville rally. https://t.co/AXTzI9dBCf", "'Is It George Washington Next Week?': Trump Blasts Monument Removals as 'Changing History' https://t.co/lEucmUqBN6", "Fallon's Charlottesville Monologue Gets Mixed Reviews https://t.co/HiESDE5ZSr", "\"READ THIS THREAD. @SpeakerRyan @SenateMajLdr @GOP @HouseGOP @SenateGOP #Resist #WhiteHouseNazis #HeatherHeyer #Charlottesville https://t.co/4UMFCw2YNl\"", "Trump is 100% correct. The violent ANTIFA left helped cause #Charlottesville riots &amp; death.  https://t.co/zgLLAS3BNU", "https://t.co/dik1XP0fzD  #LionMums2 Guam Malaysia #KL2017 #IndependenceDayIndia Donald Trump #방탄소년단 #スクフェス WANNA ONE Charlottesville 1", "A reporter asked if he planned to go to Charlottesville in the wake of the tragedy there. He replied by saying he... https://t.co/NT9fboFPOt", ".@jeffsessions We are watching you @DOJ #Charlottesville", "\"A counter protester runs by during clashes with white nationalist on Saturday. #Charlottesville \\n\\nhttps://t.co/ELwVdXk0rd https://t.co/NB9ajk81Lj\"", "Trump again blames ‘both sides’ in Charlottesville, says some counterprotesters were ‘very, very violent’\nhttps://t.co/HgdBTjY9zp", "\"Trump 'entirely correct' to blame both sides for Charlottesville violence, White House says\" via FOX NEWS https://t.co/c9NS3uJAZv", "Opinion | What Jewish Children Learned From Charlottesville https://t.co/ZkJ7xSXMYS", "\"Unreal and unbelievable!!\\n\\nYour response was #TooLittleTooLate @POTUS! #Charlottesville #CallThemOutbyName #OneSide #LoveNotHate #Resist https://t.co/RI19p3S07Z\"", "\"1 Miami News Search Businesses (Local Politicians Critical Of President Trump’s Charlottesville Attack Comments)  - https://t.co/UKxgWHmlPQ https://t.co/To64TGkWRu\"", "The white terrorists were trying to look like their own militia I don't know how those idiots didn't shoot someone https://t.co/O2hdRSpWFW", "💌😍👍🏽👍🏽👍🏽 https://t.co/onvNgnnk8F", "Nazis are very fine people said no.AMERICAN.president.ever. \n#impeachhimnow https://t.co/vthjMuewUw", "Fast Company: A Boston “free speech” rally is sparking serious concerns about another… https://t.co/EUSzHQx2XB #TechnoTerrorist,#TekDaily", "President Obama today said that it was not only the alt right who are to blame for Charlottesville but also the... https://t.co/QEUCXqk7hs", "WHERE YOU THERE\n OR IN YOIR IVORY FAKE NEWS TOWER\nGET TOUR ASS ON THE STREET\nYOU FUCKING CHICKENSHIT https://t.co/UrpG9hjcJG", "Not picking sides but this is hilarious https://t.co/ucili2KezX", "The Only Thing More Important Than Liberty… and how it applies to Charlottesville https://t.co/WWaDpO7zJf", "Crowdfunding sites refuse to raise money for white nationalists   | Via @independent\nhttps://t.co/fIw2pY9rAn", "Trump answers questions about Charlottesville at infrastructure event.. https://t.co/U322UQr4ay", "https://t.co/mKjwhVBxDu", "@realDonaldTrump This is a REAL President. Take notes https://t.co/wLXDsiBLic", "Charlottesville is just another distraction.", "Battle Over Confederate Monuments HEATS Up Due to Charlottesville Violence https://t.co/DB8S7PF9XQ", "Trump defends some of the participants in white supremacist rally in Charlottesville https://t.co/fZsZ6zoHWE https://t.co/jpURWuGEMf", "Only the racists and servile puppy dogs like @JohnCornyn and @newtgingrich will defend this. https://t.co/HgbIFAObLb", "LMAO. I'm sorry I just don't take much very seriously. https://t.co/y0uTciTbCu", "https://t.co/olyA6ItQVa\n\n@realDonaldTrump #AltLeft #AltRight #Charlottesville #Infrastructure #Jobs", "Oh dear https://t.co/h3QM1JklZI", "\"@ArtieReasonable @KGoode20 @AstorAaron @jalbert305 @konkarrne @BigHesDogg @marcorubio I am no alt-right, and def no alt-left but this smells to me!  https://t.co/RgSwNrcqIJ\"", "\"Um, no, sorry, if you're affiliated with the son, you're affiliated with the father. You've seen The Godfather, right? https://t.co/wQyHJ7SXdT\"", "Would have been great to get a heads-up from the White House about White Supremacy Week so people could plan ahead https://t.co/XoUAQqzbUs", "New post: \"After years of not waiting for the facts, Trump blames Charlottesville vagueness on just that\" https://t.co/5J3P21aQfr", "Still a fan of Van https://t.co/Yc6uopsBxK", "\"Because HE hasn't spent ENOUGH time ACTUALLY denouncing the ACTUAL events that happened in Charlottesville. Let that sink in. https://t.co/iw2eP5qf6V\"", "But they were supposedly the good guys in Charlottesville--&gt; The Rise of Antifa - The Atlantic https://t.co/51YGaBhVsJ", "@POTUS forced NoKo to back down and all we're talking about is his condemnation of both sides in Charlottesville. Classic MSM diversion.", "\"@KeithOlbermann @GailSha62072456 It's time for the past presidents to attend a funeral in Charlottesville and make a unified speech while loser watches tv from tRump tower\"", "#ImpeachTrump https://t.co/aVRMcEjDNf", "Charlottesville Democrat Resigns As His Racist Messages LEAK https://t.co/X6BG1Cjuf9", "Seriously, @HBO? Way to be tone deaf AF. #NoConfederate https://t.co/7E9Osla9y3", "Celebs react to #DonaldTrump doubling down on statement that \"both sides\" are to blame for #Charlottesville violen… https://t.co/gz2qudMQXb", "Who was at fault for the violence in Charlottesville?", "Obama's Charlottesville response just became most-liked tweet in history https://t.co/8LiNvKxi9y #SocialMedia", "Pretty sure this should be retweeted\nOften https://t.co/JorNo9cfkD", "Good picture choice https://t.co/aXOCCRQbCk", "Obama's powerful Charlottesville response is now the most-liked tweet of all time https://t.co/qDFH4xChEg https://t.co/W0DNvBiF93 &lt; www.l…", "Trump remarks about Charlottesville violence: Highlights of President Donald Trump’s… https://t.co/6XEglUT6JY", "that's how orangutan's act when they don't get their daily bananas, sorry that is really degrading to orangutans😜❤️ https://t.co/8ILYJ9OlJj", "There was a KKK rally in Charlottesville in July, but, of course, that's not the rally from a few days ago.", "\"@realJohnFKelly No one would blame you if you resigned. You are too decent &amp; honorable to be by his side. These are his people: https://t.co/fPIyn4P6en\"", "It was George Soroals birthday that day also. Hmmmm https://t.co/YP8sh79Yh8", "@johnpavlovitz You were in Charlottesville this weekend?", "Lawmakers slam Trump's latest defense of Charlottesville response https://t.co/9zyVpWhZNB via @usatoday", "A good bro. https://t.co/6yVCdsbEfO", "On the HBO special re Charlottesville, white supremacist had racial hate for Kushner bc he's Jewish and married to Ivanka. 😕", "https://t.co/hmosgkXtoV  #SDLive #Quantico #AmericanAssassin #commentetaPP #Assomption Charlottesville Sonic Mania Sierra Leone Le 1 20", "@FoxNews is getting as bad as CNN i have quit watching SMH so sad they once were my go to https://t.co/EuEwH6n2ac", "\"Unite The Right\" Organizers Jason Kessler, Richard Spencer &amp; David Duke Sued Over Fatal Charlottesville Crash https://t.co/bfIgChrGck", "\"Ther will be a lot more violence before we [alt-right] are done... this protest will be hard to top\" \n\n https://t.co/YSiE7A7Y2D", "thehill: White House instructs GOP to defend Trump as \"entirely correct\" in his Charlottesville comments… https://t.co/fTSdqvdcHH", "The truth hurts the Liberal left. The snowflakes can't handle the truth. Spoiled brats. https://t.co/0jqrj0bkM5", "#Accused #Charlottesville #Clinton #Killer #Leftist #Supported #Trump https://t.co/KrMYMRwf65", "Get away. He's from my district 😊👍#GoodCall https://t.co/01tVEMByHQ", "Really something. At the 3:45 mark here: https://t.co/sOyO2cpldy https://t.co/Y4hQRohGWG", "The Note: Trump's delayed Charlottesville condemnation may be a Band-Aid on a shotgun wound - ABC News https://t.co/wE5FrXzYhC", "Yes please, the sooner the better 👇👇👇 https://t.co/Hbs1L6OioH", "Wake up people, he's not even hiding his fascism anymore. https://t.co/fl3BWTTdXi", "#NoHateInOurState #TN https://t.co/xWFPfzGCfp", "What goes around comes around https://t.co/0PG2v3ZlWa", "#OpDomesticTerrorism #OpKKK #Anonymous #Antifa https://t.co/65a0pNGDDH", "Oh MY GOD!  ENOUGH of TRUMP-IMPEACH HIM! https://t.co/draRzyGzut", "Surely, it can't get any more disgusting than this, can it? Unbelievable. https://t.co/V0jee60O3t", "#Superhero Saves #Fiancé In #Charlottesville\nhttps://t.co/y6HWES5u9t\n\n#Worst #Crisis #A... https://t.co/QBwo2fIQPB", "https://t.co/TFgbSTclkl", "are you in need of navigational assistance? RT @rickzim88: RT @KenDilanianNBC: Uncharted waters. https://t.co/RYcpFt1gJ7", "#IMPEACH45 \n#RacistPOTUS45\n#NoConfidence https://t.co/Sly9CzwSgy", "Praying for that mother who lost her daughter (Heather Heyer), to Racism! #Charlottesville", "Donald Trump says he owns a winery in Charlottesville.  Not true.  It is owned by Eric Trump who bought it when the owners defaulted.", "Those Business Leaders have strong backbones &amp; love our country. When Bigotry spreads, we all lose.. https://t.co/HWXEubmpsU", "Unvarnished Trump fuels Charlottesville flames https://t.co/PF1PVFTvIH #NewslyTweet", "OMG...we need @SenSanders for President. Where are our leaders? https://t.co/oooQqR7EnF", "This kinda love is so hard to find God bless them❣😘 https://t.co/wMWQMJyVMp", "Like father, like son. KKK both! https://t.co/9kantRYA4A", "'Not the Charlottesville I know': Healing a city besieged by white supremacists\nhttps://t.co/t3kJOn4gan https://t.co/5YGXWxTB6z", "What took u so long ? https://t.co/hWDOUkM8oZ", "❧• Obama responds to Charlottesville with one of the most liked tweets in... Free Guide https://t.co/fcDYy8IMZo https://t.co/JmE8GSYPVX", "Que cosas! Los nazis llenan de sangre las calles de Charlottesville,pero Trump condena la violencia \"de lado y lado\" https://t.co/t8jLwIzN1T", "Trump is simply validating and excusing neo-Nazis https://t.co/sczpKI3cOk", "A FOX Trump-Lover Just Gave An Epic, Unexpected Response To Trump’s Charlottesville Press Conference https://t.co/3UoMwAyhyi via @anteksiler", "\"@SilasLongshot @stonewall_sue @POTUS I see major lawsuits coming against Charlottesville mayor and police over 20 hurt get ready lawsuits are going to bankrupt your city ! EVIL\"", "Total bullshit. #obama is a #racist. https://t.co/58RdEGyS9d", "Crazy...wonder how many msm reporters got that memo from the DNC?  Democrats are truly evil... https://t.co/4OMG61N6nZ", "https://t.co/c6CDYA7DFt", "Tuit de Obama sobre Charlottesville es el mensaje con más me gusta de Twitter - https://t.co/X8w71D79YS https://t.co/KVLEx4EJmr", "So glad I still have my Canadian passport cause this idiot could destroy this whole country. https://t.co/UcRbIyR6VM", "Watch the Vice Documentary on the Charlottesville White Supremacy Rally... https://t.co/svT9qdGteq", "Airbnb CEO Brian Chesky Has a Strong Message for White Supremacists https://t.co/EaNoAiPQuz", "What Charlottesville really needed was, The Bear Jew!!! https://t.co/5vfOVZvral", "@abbydphillip https://t.co/9JXuDMlw7G", "After Charlottesville, PayPal says it won’t do business with hate groups https://t.co/596I46jwj2 https://t.co/7f7VNsi8Oa", "\"my name's Bennett and I ain't in it!\" 😂 https://t.co/6WPHEA6q7E", "\"There is no room at the table for both you and decency, Mr President.\" ✊🏾 https://t.co/hnAYdMheI0", "Not surprising he keeps going nowhere in his quest for higher office https://t.co/RcVSmJDRQ5", "\"@cnnbrk @congressdotgov @SenJohnMcCain @SenatorCollins @lisamurkowski @GOP @OfficeGovEthics @CREWcrew @EmolumentClause @SenSchumer @MarkWarner @alfranken @RepAdamSchiff @JerrySeinfeld @SenatorShaheen @PCMag @boyscouts @colbertlateshow @TheDailyShow @maddow @Trevornoah @dccc @DNC @FEC @HouseIntelComm @HillaryClinton @SenateFloor @SenateGOP @SenateDems @FBI @nytimes @HardballChris @TheDemocrats @JohnKasich @NATO @EUCouncil @FoxNews @Morning_Joe @jeffsessions @Boeing @RepCummings @EPN @amazon @Acosta @Lawrence @ACLU @washingtonpost @SenateMajLdr #TheResistance @foxnews @EboniKWilliams #Condems #Trump personal support of #KKK #WhitePower https://t.co/juF47Pccj0 #RepublicansAreWhiteKKK\"", "@RepWalberg what is your position on trumps statement??? https://t.co/nR6g6I34x3", "I liked a @YouTube video https://t.co/XfIl3KRODM Joe Rogan Discusses Charlottesville Protests", "Yes, that is very telling, indeed. Also telling: that any CEOs are left on this 'business council' at all. https://t.co/3AjxRIQtfK", "Listen up asshole @realDonaldTrump \n\n#RESIST #Impeach45 #ImpeachNow #ImpeachTrump https://t.co/KXYkiDgQb7", "CNN: On Charlottesville, Donald Trump failed America https://t.co/1tn8YT7qVR", "You dumb peice of shit, listen your yourself https://t.co/9SJo1MlP3a", "Trump Defends Initial Remarks on Charlottesville; Again Blames ‘Both Sides’ - The New York Times https://t.co/WFn0qp5cdv", "The latest #AltRight Daily #News! https://t.co/JCUBaU9P5W Thanks to @krazio @ChicanosUEdCtte @NonnaSandy #altright #charlottesville", "\"@EricHolder One group chants \\\"what do we want... dead cops\\\" 5 get shot dead. You and the president Did Not condemn that group. https://t.co/x8nSiP3qoS\"", "ITS FUCKEN 2017 WTF https://t.co/B2KaxF2xBH", "@perryy91 @dekimbe_ @JonSchnaars5 And Nazis started the riot in Charlottesville.", "Hannity: Trump set the record straight about Charlottesville https://t.co/htXKxbXDIS https://t.co/167ZGYazKA", "Why Charlottesville, Liberal College Town, Became Ground Zero for White Supremacy https://t.co/D5kzctGJsL https://t.co/3jYBrieAp0", "Trump touts winery when talking Charlottesville https://t.co/TMhd19dZeA", "\"@cballgame @kenrosenblood @Joel5326 That didn't happen in Charlottesville, I think that was in NC. And I don't recall using the word peaceful (could have, but I don't think so)\"", "Even Mexico understands the Nazis were complete scum. How did we allow #Charlottesville to happen? https://t.co/HUrGysHBrk", "\"@AP @komonews He also said today that he watched what happened in Charlottesville more closely than any journalist in the room. Wheeeeeeee!!!!!!!\"", "@andersoncooper report on Trump's opionion on Charlottesville moved me to tears. I'm so disgusted, upset and angry.", "#ImpeachTrump #Impeach45 #ImpeachNow #ImpeachTrumpPence @realDonaldTrump @IvankaTrump @MikePenceVP https://t.co/v2md3a8pRa", "@JackPosobiec Not the Charlottesville Police Dept?  Not the Mayor?", "\"Charlottesville is the best place to live in America.\" That's what wiki says. However, this matter happens. \"What does it really mean???\"", "It'll work on the cult following https://t.co/qJdX2mIOh6", "Someone get this damn clown out of the WH https://t.co/bmeHfSalEA", "Using social media to identify Charlottesville attackers can be dangerous — via Propublica https://t.co/7ecrn4DJPp https://t.co/RNyZi7Y91r", "2/2 We must have open minds &amp; hearts and find opportunities to address our own past here in Wilm. #Charlottesville", "Why were the Charlottesville Marchers Obsessed with Jews? https://t.co/1LGNKXiTVw", "Y'know, if stupid really was terminal, things would be so much calmer. https://t.co/l3KijPS2lr", "Alveda King on Trump's Charlottesville remarks-Fox News @realDonaldTrump Ur a FAT DICKLESS LOSER #fake45 #Traitor https://t.co/rkEkqRI89g", "@laceandlily Idk I'm not Maiko but in my case yes I'm tired of Charlottesville being on my TL", "New post: \"Donald Trump's Charlottesville Press Conference Has Roots in Fox News and Twitter\" https://t.co/AdH7Ym23zZ", "\"@AP: “alt-right\\\"=mix of racism/white nationalism/populism embraced by some white supremacists + white nat'lists...\\\"  and our President. https://t.co/rBaSX4eG3G\"", "\"@VanaukenMichael @JordanjMoran @DarrienMoran just watch it. No one would ever say vice is msm. Only facts here with video and interviews https://t.co/Hr3f8yDpE3\"", "This man better not have to pay for a beer anywhere for the rest of his life. https://t.co/FwCXP5BXNX", "Cooper: President for all or just alt-right? @CNNPolitics https://t.co/OuO60x6sDk", "The Fake News watchers/followers will never understand what's going on. https://t.co/94MVZ7qAsW", "\"CNN : Two women injured in Charlottesville, Virginia, are suing white nationalists and car crash suspect James Fie… https://t.co/QyY8YRVWKP) https://t.co/FqLP1kFPRI\"", "No chance of this ending badly... https://t.co/lO1Riqi61r", "White supremacists praise Trump’s ‘fair,’ ‘honest’ condemnation of ‘both sides’ in Charlottesville https://t.co/pYiufVkijJ …", "This is what fake christian @SarahHuckabee supports... https://t.co/tWBjtwaliJ", "You Will Not Replace Us #charlottesville #unitetheright (pls RT↺❤️) https://t.co/89J2Ucbx2a", "And of course, they turn around and blame us for everything. Rotten to the core. 😡 https://t.co/ouYnBcbCfT", "Trump: There were many 'bad people' in Charlottesville\nhttps://t.co/tREImAvyKo", "\"@SenJohnMcCain @MeghanMcCain Thugs are thugs. Left and Right have them, and they all showed up in Charlottesville. YOU should say so RINO. #RinosOUT #TrumpNotMcCain\"", "Newsflash #America - you fricking elected this donkey!!! Sad, but true!! 😪 https://t.co/qhfHZMMcNw", "#AmericaFirst #GOP #AltRight #charlottesville #Freedom #Discrimination  #gop #nra #nra #ccot https://t.co/8bLFAuZIH7", "Trump uses Charlottesville press conference to promote his son's winery. https://t.co/uXt7kNMkD5", "\"Trump's logic: if neo-nazis &amp; #WhiteSupremacists have a PERMIT, then its okay. 😒\\n#CNN\\n#Charlottesville\\n#ImpeachOrResign\\n#ImpeachTrumpNow https://t.co/Esbdg74e4w\"", "Abre o Jogo – A verdade sobre Charlottesville e o nazismo de “extrema-direita” https://t.co/Pu2pdRIQkr https://t.co/tdUw31tzVH", "Circle the wagons https://t.co/a4xkUGaXNA", "Is it just me, or is the #Charlottesville reaction cycle by the Trump-right a lot like the #TrumpRussia one?", "Everything about this is very serious but I can’t help noticing that these white boys can’t chant on rhythm for shit https://t.co/qz9HrqmaSa", "The Charlottesville Car Attack Might Have Been Legal Under These Republican Proposals\nhttps://t.co/fjDByFHhZi", "@realDonaldTrump @TheJusticeDept  You Must Arrest the Politicians https://t.co/yggRFXIMtn", "\"Very Fine People Safeguard Jewish Religious Practice\" https://t.co/rzrhgsEige", "Digging The Hole Deeper https://t.co/8J91NuGIma", "@SenShelby Where is your condemnation of our president's remarks this afternoon? #Charlottesville", "Arnold Schwarzenegger Donates $100,000 To Anti-Hate Group After Charlottesville Violence - HuffPost https://t.co/NLPOLhivYL", "Solidarity &amp; empathy to my fellow POC who feel more alienated &amp; disheartened bc of hateful events. You're not alone. #Charlottesville", "\"@JDMorgan @realDonaldTrump No would shouldn't have to be explaining to our children about #Charlottesville because it should've never happened!\"", "Absolutely terrifying. https://t.co/g5l2zIpyZ0", "Vote! https://t.co/CqoasKgHo4", "Yup. Even Black cops are racist. See the message? It's about destroying America's fabric, not racism. https://t.co/SF1y0lJUA8", "but her EMAILS! and remember Benghazi???? come on peoplel!!!! https://t.co/yftGcKdF2v", "New poll. https://t.co/uUsPK8x6R2", "Telling https://t.co/5xE0KuQvaA", "New post: \"Van Jones on Trump's Charlottesville remarks: 'I'm just hurt'\" https://t.co/7FpeHRZs9z", "Revealed! George Soros linked to Charlottesville violence https://t.co/OgygvBZ9XV via @ReadTheHornNews", "LeBron spoke on Trump's response to Charlottesville: https://t.co/kdRveyW3tB", "https://t.co/lCC75Y39Se  #LOVE_YOURSELF #PeachGirl #เล่ห์ลับสลับร่าง #รักตัวเอง #SEAGames2017 NCT DREAM Charlottesville #NMB48BKKASI 54", "\"Nothing Donald Trump said Tuesday about Charlottesville hadn't already been said on conservative media, or by the … https://t.co/ykQgkUMB78 https://t.co/mkqkGH9xrZ\"", "The latest The Paper Magnolia Daily! https://t.co/Z5bG1AU9bX Thanks to @insidefilm @marinasgo #charlottesville #riverdale", "\"@davidlehmann09 @JamesvonBorcke @JoeCienkowski @FimusTauri @DeFactoAtheist1 @monster_959 @LanaResistance @CollinOctantis @wallstreeter43 @jnstraining @sagedapprentice @Paulebels371 @ATL_TN_Hybrid @IcedAtheist @hubie0 @jack_son_black @scerloth @LoriCopley @homen2 @S3nt13ntB31ng @colvin127 @TedPerkins10 @magic_no @CubeSteve @phillyjohn19047 @SavageAtheist @silkyboy78 @sazal35 @Henson813 @The_Vagitarian @gregsart @Wileylm @CanAgnosAtheist @Paul197 @dcj_daniel @DannytheInfidel @TakeThatDarwin @sonjamotzkus @Kwide81 @Lava_J42 @Ptsk @ryscottjohnson @HELENO7HENZO @rarey4 @georgewells08 @PainesReason @Yathoon @Tacere69 @bzsigns @almightyk9 Stuff like this keeping it stirred up! https://t.co/A4dKhSkKyY\"", "What happened in Charlottesville has happened under your watch @realDonaldTrump #ImpeachTrump", "What Jewish Children Learned From Charlottesville - The New York Times https://t.co/PoYGV9NRpG", "\"@realalexjones @Millie__Weaver Millie, you reported this from a car immediately after you and your cameraman were pepper sprayed. Bravo! https://t.co/OCcfi8syn6\"", "@SmithCyndyCyndy @MarkDice agree charlottesville was a set up by left because their russia russia stories are fading", "\"Later in news.. unexplained fire devastates &amp; wipes out Trump' s Winery. Security guard reports hearing f*** all that they forgot About Dre https://t.co/ThwEgfuTSj\"", "Proud to share my last name with Governor McAuliffe #norelation https://t.co/vhDOiCtWR2", "Why The Hell Did The Charlottesville Cops Stand Down? https://t.co/B2YWxruWHM via @Doug_Giles", "Charlottesville: Black protester Deandre Harris ‘beaten with metal poles’ by white supremacists https://t.co/aldHExA2eq @POTUS45", "Nearly EVERY small-medium size Southern Liberal town has been infiltrated by a Wes Bellamy of #Charlottesville.\nMore chaos to come.\n#MAGA", "\"There is blame on both sides\" for the deadly violence last weekend in Charlottesville: Donald Trump\nhttps://t.co/HGgOYXEwfX", "WOW. Wow. That's all I can really say. Everyone should watch this. https://t.co/SjzI7MTe95", "Ryan, other Republicans outraged by Trump news conference - POLITICO via @POLITICO for iOS https://t.co/BNSqOmBjQF https://t.co/lEnc3PaT2J", "Trump decries 'alt-left' in Charlottesville: 'Do they have any semblance of guilt?' | https://t.co/LpW8pkIBtB", "\"Stop  malicious lies of the violent fascist Left.\\nhttps://t.co/GIvzDhYapb\\n\\nand Was Charlottesville Riot A Set-Up?\\nhttps://t.co/lK0JruZRKS https://t.co/WIPb6O9IOT\"", "Yeah. They're really \"quietly protesting\" @realDonaldTrump https://t.co/V2FYq6Hc3x", "\"Advocating for expansion of civil rights for all citizens VS mob intimidation &amp; attempt to assert dominance over citizens. Not equivalent. https://t.co/fREoRZbziu\"", "@realDonaldTrump @POTUS \n#charlottesvilleterroristattack\n#Charlottesville #TrumpKKK \nhttps://t.co/6uBJgXI497", "a story you will never see on @CNN https://t.co/7yIOmfXJHm", "Pretty soon it's the flag https://t.co/Nwy76mqD13", "\"It speaks volumes that the only people applauding Trump's comments from earlier today are piece of shit white supremacists. #Impeach45 https://t.co/SLBBymYeM0\"", "#45 stands by remarks on Charlottesville: 'George Washington was a slave owner'...#45, what an asshole. \n\nhttps://t.co/2jnL52PLab", "sometimes, i hate america. https://t.co/GxWnVmZVPi", "This White House. Not enough SMDHs in the world. https://t.co/tfjARkg2Nw", "#IMPEACHTRUMP What Jewish Children Learned From Charlottesville https://t.co/UMofVCq3mp", "Hmm... https://t.co/I2JOh2h4r8", "Tell @Pepsi @Walmart and @Chase CEOs: Dump Trump and #QuitTheCouncil now! https://t.co/x6d7da0GjK #ImpeachTrump #Charlottesville", "After years of not waiting for the facts, Trump blames Charlottesville vagueness on just that - CNN https://t.co/TegWCLbOFn", "After Trump’s Remarks, White Nationalists Say He’s Telling Truth About Charlottesville https://t.co/vSesmaxmjJ", "\"So not only does 45 give  license yet again to white supremacist but also to an abuser.  This terrorist  also abused his very own mother. https://t.co/EmED1OeGLF\"", "Seth Meyers' Statement on Charlottesville ... here's to \"normal, decent persons\" https://t.co/luQZrHVQJk", "RT michaelzimmer: Trump’s off-the-rails news conference on Charlottesville, the ‘alt-left’ and infrastructure, ann… https://t.co/uS1V8lFTz9", "Help identify this Coward \n@WVPolRevolution #Resist  @bernieforttown #Charlottesville  @TNWomen4Bernie https://t.co/lPPTMUL8Dr", "You Will Not Replace Us #unitetheright #charlottesville (pls RT↺❤️) https://t.co/jqiAJhz1Fc", "@JerryPiggott1 @midnughttune @Lyn1350 @SoCal4Trump @MittRomney https://t.co/6FixBlnMOM https://t.co/SkXxpcVkUP", "\"\\\"JUST Book Me On BOOKr\\\" -- Charlottesville Car Attack Victims Sue James Alex Fields and Rally Organizers for ... -- https://t.co/sCXleMW3jX https://t.co/G7VjgC2bmB\"", "Charlottesville: Race and Terror – VICE News Tonight on HBO #thetruth #Charlottesville #kkk #nazis  https://t.co/jkyK6ww1ov", "@joshua_eaton Nice to meet you in Charlottesville", "'It Was a Moral Disgrace': Krauthammer Spars with Ingraham Over Trump, Charlottesville https://t.co/yF22eojOAO I hate it when I agree w/ CK.", "HEY @joshtpm WE HAVE WRAITHING LIVE ON VIDEO! https://t.co/N88YOy52T3", "A Combative Trump Criticizes ‘Alt-Left’ Groups in Charlottesville https://t.co/NVixBdFefj", "Why I'm NOT Sorry About Charlottesville https://t.co/sizfxmnKav via @YouTube", "#Charlottesville #HeatherHeyer #NeverForgive #NeverForget https://t.co/dgjdQlcvUY", "@CNN WH CofS Kelly has to resign after Trumps performance staying on says he personally supports Trumps Statement on Charlottesville.", "REPORT: White Supremacist Leader in Charlottesville Jason Kessler Was Obama Supporter - Occupy Protester https://t.co/fYKa5guH9w", "Charlottesville Vice Mayor Wes Bellamy repeatedly calls Trump '45', refuses to call him president", "#NBA Wire: LeBron James speaks out on Charlottesville tragedy https://t.co/hRib2e3GaF https://t.co/ztpVn5Zy8N", "#impeach #NOTPRESIDENTIAL Did you know a nazi killed a woman you repugnant douchebag?! https://t.co/dLNBP3pEoG", "IA stands with out brothers and sisters of Charlottesville!! ♥️ #Charolettesville #IAstrong https://t.co/oRQBmHHlSA", "Donald Trump tried to shut the media up about Charlottesville but now they are completely losing it like they did with Russia.", "How Trump's Charlottesville response emboldens white supremacy https://t.co/UaM7JAydAX", "this is important. https://t.co/PbKCaZAMZg", "via @Independent  https://t.co/2lHlYbpiFb", "Donald Trump, from His Tower, Rages at “the Other Side” in Charlottesville https://t.co/fZahr96jWe https://t.co/Wr7pXgjYva", "More like \"from the pocket\", since he owns a Winery in Charlottesville https://t.co/bnyovFtMuG", "\"Can't leave little Jarred behind. ANYONE who stands with pig, doesn't stand with America. Disgusting pile of steaming elephant shit. https://t.co/23O6PGzwUY\"", "Barack Obama, Our One True President, Went Viral For His Comforting Response to the Charlottesville - PAPER Magazine https://t.co/PpZbSEC0gN", "\"@TennCup The bigotry &amp; ignorance is thick.\\n#Charlottesville #Durham ##Catholic #JFK #antifa #Haiti #Wikileaks #SethRich #tcot https://t.co/lz1VHlObns\"", "Is this what we have come to?\nCan't stop crying, how is this possible?! https://t.co/xOINJ7Z6Cq", "Really started crying watching one of these videos drom Charlottesville.. man, wtf is wrong with this world!", "El ex líder del KKK alaba a #Trump por ´decir la verdad´ sobre #Charlottesville. https://t.co/M9b8hqLJiQ", "https://t.co/NzMEJxPYT3", "RT jojoh888: Virginia governor &amp; #Charlottesville Mayor let Antifa raise their flag at city hall. \n\n#AntifaTerrori… https://t.co/DAYZwrPQRV", "And black voices. Oh and stop telling black people how to protest. https://t.co/BdAHBBNNX2", "Thank you @jimmyfallon for making this statement last night. https://t.co/0OId39KkhD", "We are better than this, people! #Truth #FuckRacism #LoveTrumpsHate https://t.co/YPWqfF5sLn", "@JohnFasoNy This is lame. Where is your real support for Judaism. Where is your repudiation of the neo-Nazis of Charlottesville", "\"@realDonaldTrump is a racist sociopath and a joke of a president. @GOP leaders already leaking his wacky-ass demands to rest of the world. https://t.co/oaUvWAXIzW\"", "Charlottesville: America’s fork in the road https://t.co/JNeIdghmfo https://t.co/JYF1dux3my", "This Vice News Documentary from Charlottesville Is Horrifying https://t.co/81KZrwfTd9 via @Esquire", "So, basically lie. https://t.co/AskENZJGOm", "'ENTIRELY CORRECT'  WH stands by Trump's Charlottesville statement https://t.co/c054hlVU4b https://t.co/k01WFtwcGS", "\"Peter suffered no repercussions Bc he was practicing his freedom of speech, ON THE OTHER SIDE, @colinkaepernick is jobless for using his https://t.co/X8eymTVF9f\"", "In my 21 years of life I thought I've seen it all folks but for the first time in my life I have no words https://t.co/9OlPeM4Ths", "@realDonaldTrump The biggest winery in the world, the one you own in Charlottesville, says they're not affiliated with you. #SAD #psychopath", "Not bad! #riot https://t.co/UUUOG62578", "After Charlottesville, PayPal says it won&amp;#8217;t do business with hate groups https://t.co/Xd4AIKMg9L -FastCompany #technology", "#changethenarrative #charlottesvilleterroristattack https://t.co/J06WV3dSkA", "#dumptrump. #resist https://t.co/jNV506XG8e", "Gostei de um vídeo @YouTube https://t.co/TC8DXaoHvf Crazy: Donald Trump's Charlottesville Press Conference", "So the WH is confirming that POTUS is a racist Nazi sympathizer. https://t.co/uCdQlj6QQU", "If you're still unclear about what happened in #Charolettesville or about white nationalist views, watch this. https://t.co/A6Xhs7LHJi", "Worker loses job after being outed as Charlottesville protester https://t.co/GXuhldiHdw", "https://t.co/OfsUPs8xle  #SDLive #Quantico #AmericanAssassin #commentetaPP #Assomption Charlottesville Sonic Mania Sierra Leone Le 1 35", "Worth a read: \nhttps://t.co/2ZHCUGL3OC", "\"@mrshananto @mmfinke True Ligwina, the prophets teachings &amp; sunnah would lead to the end of slavery. Anthrope was just connecting it to Charlottesville as a joke\"", "Reddit y Facebook prohíben grupos de odio después de ataque en Charlottesville https://t.co/YktQD3hRXp", "\"Great resources for addressing Charlottesville Hate Rally in the Classroom https://t.co/REeigbp60g … via @educationweek https://t.co/VXm2EbAHP1\"", "Trump: Both sides to blame in Charlottesville violence https://t.co/9viFUJOYK2 https://t.co/FVTgLb2zU5", "@KristineAz let's not bullshit ourselves, the counter protesters caused 100% of the violence in #Charlottesville", "CHARLOTTESVILLE: James Fields - Patsy | Aangirfan https://t.co/Rp24egFERR", "Late night reacts to Charlottesville violence https://t.co/QKorzBt0VQ #Video #USRC https://t.co/7uFOBAOlIb", "Trump estima que en actos de violencia en Charlottesville “hubo culpa de ambas partes”\nhttps://t.co/3jOfi2Rk11\n#RCNRadio Vía rcnradio", "#MAGA #TrumpTrain https://t.co/5b9pvo73pb", "\"When you're a liberal democrat I guess that come with a license to just make sh!t up! You have no business in the senate. #Charlottesviille https://t.co/lPKeRxIs7N\"", "@MZHemingway https://t.co/wjVqXoULE1", "Charlottesville showed that liberalism can’t defeat white supremacy. Only direct action can. - The Washington Post https://t.co/HD4ADvY0j9", "This speaks volumes! https://t.co/NQEw292cry", "How Mr. Trump Could Face Up to White Supremacists @via NYTOpinion https://t.co/1Fo4HzhZKQ", "America I hope you are watching those who are trying to exploit the situation in Charlottesville for political point. We will make them pay.", "\"After UVA/Charlottesville, Before Richmond and VT/Blacksburg: Gathering for a Proactive Plan. 5-7pm, Wed 8/16 #Charlottesville https://t.co/hYcU3LJnYI\"", "@POTUS, we used to have a name for people who fought Nazis in this country: Patriots. You know, when we were \"great\" #charlottesville", "\"Facts are captured on video.The violent groups in #Charlottesville were Democrat created from the #KKK to #Antifa.All Democrat perpetrators. https://t.co/v7RgYe56Gh\"", "\"Wrong. 1. Community of Charlottesville had already agreed 2 take Lee's statue down. 2.Those who took down statue in NC will face charges. https://t.co/qMy0udU70w\"", "対米従属している限り、特に安倍首相の場合は言えませんね。 https://t.co/jFQTwqlald", "\"Seth Meyers Launches New Series: “Breaking Crazy, Donald Trump’s Charlottesville Press Conference” https://t.co/FLV1zAZXu2 https://t.co/nimNS2Ffan\"", "#NBA Wire: LeBron James speaks out on Charlottesville tragedy https://t.co/Zb6Q1od3A8 https://t.co/07uUyPGgi5", "@MMFlint actually bussed the audience from his Broadway show to Trump Tower tonight for a protest. Now that's a #troll. #Charlottesville", "\"@TaylorSaysIt @MattMurph24 Brewer is an imbecilic, racist, bigoted, homophobic moron.  She fits right in w/ #DonaldTrump &amp; his ilk. #Resist #DonLemon #Charlottesville\"", "Yes thanks for sending the House and Senate back to the Democratic party.😂😂😂😂😂👏👏👏👏👏👏👏 https://t.co/3yoz2bBDSq", "Wow!! https://t.co/TuafXKnY5F", "Gee.. I wonder who Trump is going to attack in the  morning https://t.co/Y8nRZSbB52", "only the upmost respect for my president https://t.co/hzcuirAzge", "@Cernovich There were at least 5000 Nazis in Charlottesville alone, Mikey.", "Absolutely right. . 200% https://t.co/Dy5B3FxnbJ", "Van said it best tonight. https://t.co/w0VL0ocOQO", "you confuse facts with perception- get a dictionary! https://t.co/3nVrc1ZyDb", "Yes indeed. This face tells all. American has sunken to its worse. MAGA?? Sorry but no. Impeach Trump. https://t.co/IxNOgyy3l9", "\"@BonnieMac29 @Amagwood28 @13thconcept_ @bakedalaska So you recognize the same people from starting fires as the ones in Charlottesville?  Or are all black people the same to you? Wtf\"", "\"Local College Student Involved in Charlottesville Turmoil #digitalmarketing #news #today https://t.co/dhLAQkzXdM via @Easy_Branches https://t.co/E5psG4AuiW\"", "Just fuckin wow. CNN's Anderson Cooper analyzes President Trump's staggering news conference in New York.\nhttps://t.co/CASU7wUDoc", "RT voxdotcom \"As soon as Charlottesville happened, Trump stopped talking about North Korea. Things calmed down alm… https://t.co/u5uiGAzdfT\"", "\"#trumpism Homophobia, sexism, racism, anti-semitism, nationalism all grow in the same dark place #impeachtrump #charlottesville https://t.co/WABLqPER8h\"", "meu deus. https://t.co/TtzeBm39Wf", "@cthagod yooo you do kinda look like Morris Chestnut 😂 https://t.co/8RF1NhNNMb", "\"No Mike-During Calvin Coolidge era 50,000 masked sheeted Klansmen paraded down Pennsylvania Ave-\\\"Media&amp;Left\\\" had not even been invented then https://t.co/JxlFFETmE4\"", "\"You could hear emotion in his voice speaking of his Godmother &amp; all she went thru. Sad that we have 2 keep fighting the same damn battles. https://t.co/T9C9pKV7m4\"", "@TheRealDicmo @bbusa617 @GovernorVA https://t.co/h2KGXmOATE", "https://t.co/AfIAafLBZf #BothSides #ImpeachTrump #NoConfidence #impeach #ImpeachTrumpNow #pussyhat", "Trump touts winery when talking Charlottesville https://t.co/KlYaJm6Pvr", "\"from the root to the fruit\" https://t.co/dQLEBKq14A", "Let's go yell at a building. Why don't we write Trump on the sidewalk and yell at it? https://t.co/QrbUpi5iS7", "Very powerful message by Van Jones... https://t.co/XfzUrADHHb", "UK Telegraph: Donald Trump says both sides to blame for Charlottesville violence and the 'alt-left' bears some ... https://t.co/0ck4e7GLQ7", "@MSNBC @CNN @HouseGOP @SenateGOP  whose idea is this. Since when are patriots bad https://t.co/VijcnIOoPC", "What The Media Isn't Telling US About Charlottesville, How #BLM &amp; #ANTIFA Incited The Violence\n\nvia @theEagleiRising\nhttps://t.co/mhfjgNm7FX", "This Yankee was taught TheCivilWar was fought/won 4the south to found roots in a union willing to work 4equality\n\nhttps://t.co/b0FvlIHZ29", "A partir del 44\" https://t.co/vL4lQIojAJ", "Watch this https://t.co/37UtT3nnzu", "@millimarc123 @becky1363 @pjcobbrocks5 @Deplorable80210 @lumenaequitas @Cali_Deplorable https://t.co/RpXkY8cN7E", "\"If u feel him blaming one side is better you are the idiot,  2 groups went to head to head and both are to be disavowed. https://t.co/gYsjncPg9j\"", "People gathered at the National Mall Tuesday night in an effort for peace after the violence in Charlottesville. https://t.co/b20dXGui4f", "Islam? https://t.co/U1sw4wD8Vq", "Politicians react to Trump’s comments on Charlottesville https://t.co/iWD4zxFLNs", "Obama's Charlottesville response just became most-liked tweet in history https://t.co/rHJ6tUepPW https://t.co/Ucshy9fLTG", "DEADLINE: Michael Moore Leads Audience In Trump Tower Protest After His Broadway Show https://t.co/sOzwPJWG3V https://t.co/rbVLkt13hO", "\"@seanhannity until Saturday I thought our country had a chance what I saw in #Charlottesville I have little hope and what the #MSM spews we are doomed\"", "@newtgingrich Dont you dare divert attention from what happened in Charlottesville. We will not be silent on hate. Shame on you", "Unacceptable. https://t.co/fbADKFsli6", "\"'Ignoring it is just as bad as supporting it:' Late night hosts get serious about Charlottesville https://t.co/fEpEY9vBl3 https://t.co/hpVTZF1wah\"", "Attacking Reporter #unitetheright #charlottesville (pls RT↺❤️) https://t.co/mk4ybICp5z", "\"@nstretcher @HowFashionating @DustinGiebel @DouxDux @marcorubio Only one party openly courted these bozos too and we all knew it wasn't HER party! #Charlottesville #ImpeachTrump\"", "@mitchellvii Government raises antifa flag https://t.co/hgkpfgyDPG", "Trump again blames ‘both sides’ for violence at white supremacist rally in Charlottesville https://t.co/yhVfE1U1vD", "LeBron James speaks out on Charlottesville tragedy https://t.co/4aUx2UOBVG #basketball #sports #NBA", "Un tweet de Barack Obama sur Charlottesville est en passe d'être le plus liké de l'histoire https://t.co/lCFMnGHRPM via @MashableFR", "@Edivellent @ImDiabetus Like put your energy into the Charlottesville stuff not Fantasy Football auction drafts smh", "\"Take note: Macklemore more eager to denounce association w/racist Haircut, than Trump is to do so with Racist Murderers. #Charlottesville https://t.co/9bvZlk4XYq\"", "politico: FULL TEXT: Trump’s comments on white supremacists, ‘alt-left’ in Charlottesville https://t.co/OOjSlphcFG https://t.co/gdyAlwqXEn", "6) This created an excuse to go to #Charlottesville under the guise of free speech to hassle the virtual signalling town.", "Watch VICE News Tonight’s full episode \"Charlottesville: Race and Terror\" https://t.co/mLByp9TDkj via @vicenews", "🔨 Trump Hammers Fake News for Ignoring Alt Left Violence in Charlottesville #GREAT @POTUS briefing! https://t.co/lTVp14t9kJ", "\"Some great information for people that want to help but are unsure how. Though the original post is 3 days ago, its definitely still viable https://t.co/dqobtYSrZr\"", "Will u PLEASE stop micro-analyzing &amp; nitpicking every Trump statement on #Charlottesville? This is getting tiresome!  #FoxNewsSpeciaists", "What's funny is that hip-hop music that actually addresses issues like Charlottesville are not given attention yet claim it's dead #HipHopEd", "Obama's Charlottesville message https://t.co/an0KpWRdMD", "\"#Charlottesville #ImpeachTrump #heroesresist #GoodNightAltRight #ResistTrump #WhiteSupremacy #NoConfederate #Resist\\n\\nhttps://t.co/ifkkJT8uKp https://t.co/WJZtsXCzfY\"", "\"@seanhannity @RevCLBryant This👇is your legacy, #foxnews, #hannity, and every #republican in whatever the hell the #GOP has become.\\n#AltRight\\nhttps://t.co/qrwniNHIeX\"", "White Nationalist Who Participated In Charlottesville Clashes Lives In Keene https://t.co/0qX6wFL7pO https://t.co/XSbdByIOdT", "Trump Refuses to Blame White Nationalists for Charlottesville Violence. Now They’re Celebrating. – Mother Jones https://t.co/iRGBiAdJnt", "\"This dude is a horrible excuse 4 a president and a human being. You have one responsibility right now and that's to racists... Still waiting https://t.co/m8OF82lB4j\"", "Just seen this it's so great. Love when he runs off into the trees \nPolice protect the Nazis as always tho https://t.co/Ha8PZoDBP3", "\"@Purrpatrol @thetideishigh_ I knew if I stayed up I'd be rewarded. @seanhannity is blaming PBO 4 #Charlottesville. What the hell is wrong w/ Fox? This is pure bs\"", "Rep. Raul Labrador issues a statement on the violence in Charlottesville, Virginia https://t.co/hOkzVoQdHO", "Why the Nazis came to Charlottesville? \nhttps://t.co/GOXhz0bdnA", "Watch #VICE on @HBO especially last night's episode. World news you need to know. #Charlottesville", "A friend sent this to me:  Trump talked today, 08/15/2017, about the \"good\" alt-right people in Charlottesville.... https://t.co/42sdcUqX9I", "\"I'm not aware of that but I will find out.  Even if they have, we won't have a Charlottesville here. That how we do #kansascity. #befrosty https://t.co/vTOeknDVoA\"", "Did we witness the first skirmish of the next civil war? #Charlottesville These Nazis need to be stopped. We fought this war already.", "Lawmakers slam Trump for laying 'blame on both sides' in Charlottesville rally:  https://t.co/Vm3Tot06f0 https://t.co/lsARlYedyN", "\"+https://t.co/sWmoV0ErpB Fox host goes into meltdown mode over Trump’s latest Charlottesville comments: ‘D... https://t.co/cDI2GkKqwm #news https://t.co/1Yef9rO0PB\"", "After Trump’s Remarks, White Nationalists Say He’s Telling Truth About Charlottesville https://t.co/PQm9EXMPZN", "To the people of London,Paris,Japan , China , South Korea , what is your reactions on the terror of Charlottesville, VA", "ai lambe meu cy cheio de merda https://t.co/v7uYtV0PfN", "You've got 2b fucking kidding me #FuckTrump #FuckWS - Trump: 'Both sides' to blame for Charlottesville @CNNPolitics https://t.co/ChOQF3ItIh", "@JennaJR22 Everyone needs to troll these types! #ImpeachTrump #CNN #FoxNews #POTUS #MSNBC #Charlottesville #impeach #potus45 #Impeach45", "The Blade! @toledonews https://t.co/E29bXkeEZI", "BUSTED: CNN’s Fake News Lie About Charlottesville Mom - https://t.co/dKcTe0PgaM", "Trump besitzt ein Weingut in Charlottesville. Das war ihm noch wichtig zu sagen. So krank.\nhttps://t.co/uAsCwr5oRS", "\"now just imagine if Black ppl had done some shit like that.  there'd be global stop and frisk, locking up kindergartners... https://t.co/olhW6VWEDz\"", "4. Spread this truth. We are one human race. #NoHate #Charlottesville @physicianwomen", "Someone needs to come up with a new term for this. subhuman evil doesn't cut it https://t.co/UnEDmeLVrM", "2017 EMMETT TILL https://t.co/C5n8nHCzkI", "Click here to support Support for two victims of the Charlottesville attack https://t.co/cbXdxNHHYe", "Gary Cohen you should read this - and then try to explain how you can work for Donald Trump https://t.co/mmj44nqGtS", "They are not 'alt right'. They are white supremacists and Nazis. Let us label them correctly. https://t.co/9KPcjOaYlb", "@MittRomney Thank you. We need more leaders to speak out about the tragedy in Charlottesville.", "Judge Napolitano talks DOJ probe of Charlottesville attack \u0096 TruthNation https://t.co/02OPK0z4fO", "am i blind or did anyone else think this was pewdiepie https://t.co/33BaxItOYD", "CAMP: Trump’s Calculating Response To Charlottesville https://t.co/PPf4qonA8V", "\"That would be both sides as in the Allies equally to blame as they landed on the beaches of Normandy to fight the Nazis? https://t.co/sl7bX2TvFU\"", "Trump: ‘Not All of Those People Were White Supremacists’ https://t.co/yfCeKwOfH5", "Been reflecting on St Mary today – not just because it's the feast of her dormition, but also because of Charlottesville.", "Sadly, the elite want a civil  war and tell cops to stand down until un-permitted #Antifa and #BLM cause a riot. https://t.co/OmMIIHqa2U", "@Bryan__Gibson @marcorubio @POTUS File \"things he shouldn't say\" to \"things he saw on his Twitter TL &amp; Fox News\" https://t.co/AsyvFdH2vp", "#Trump #Charlottesville 2-sides -Only 1 was armed, spewing hatred, looking for a fight &amp; committed murder @NYTimes https://t.co/IXaayeaFbE", "\"@washingtonpost Where is WaPost the Alt Left on the Mayor of Charlottesville having police to stand down, not interviene in the violence? T Robert Byrd, Dem\"", "\"@newtgingrich White Supremicists chanting in Charlottesville reminds us right has given up thinking for yelling. Sad rerun of Fritz Kuhn. https://t.co/ElK9KVuZI4\"", "What is going through John Kelly's mind as he listens to his dipshit boss talk about Charlottesville. \nhttps://t.co/2bhCZfDLPV", "Obama's Charlottesville response just became most-liked tweet in history #Tech #TechNews https://t.co/4lSyV2qeyJ", "How is laying blame on both sides \"at odds\" w/truth?\n\nTrump Says ‘Both Sides’ to Blame in Charlottesville Violence  https://t.co/4cglOnQ8lE", "From GoDaddy to Intel, @KurtWagner8 tells us how tech companies have been responding in the wake of Charlottesville: https://t.co/Nlo4L21M6S", "\"@MannoiaChris ex nsa experts told The Nation DNC hack was fr east coast, cld not hv been russia. charlottesville big distraction. see article.\"", "People rally in Halifax to show solidarity with Charlottesville, denounce racism - The Globe and Mail https://t.co/UVgcSp6Elz buy", "\"The Antifa, undercover police, was there to provide \\\"left\\\" violence. Probably lost the nerve worried the nazis might shoot them by accident. https://t.co/HVwsWvYDhF\"", "Now trending @foxnews \"Trump 'entirely correct' to blame both sides for Charlottesville violence, White House says\" https://t.co/1chqf9Yycy", "Well said! Thank You, President Pollard! https://t.co/9Nv7SRliDG", "Figures. A nightmare is coming~Weeks before a violent white supremacist rally in Charlottesville, Virginia, led... https://t.co/YlIUlveb25", "Hmm... https://t.co/7UkvBZLIdx", "U lost any/all credibility when you son got locked up #Charolettesville https://t.co/XYy7pX7dPm", "\"Needs to be retweeted over and over - if that will do any good. Facts don't matter to the left. #Charlottesville #Liberals https://t.co/8SFYqhg18c\"", "(via https://t.co/NPLd7drR9U ) CNN: RT AC360: Trump supporter on POTUS' Charlottesville violence remarks: \"What h… https://t.co/VVh53YCCdr", "@chuckwoolery It's not a smear when Trump himself rationalizes for those who participated with those groups in Charlottesville.", "Poetic Justice https://t.co/EHrRt2yS4M", "RT trigonis30: RT StephenAtHome: \"I don't agree with the Nazis, but they had a permit for Normandy &amp; the Allies di… https://t.co/YIODzl5yja", "Watch The #art Murals of the #Charlottesville Area, Last Sun, @Starrhill held a community paint-by-numbers event. &gt; https://t.co/oVOK9IXgro", "Wow...Charles bringing the noise https://t.co/TUHVIaNUQT", "Trump doesn’t own Charlottesville winery he claimed he owned https://t.co/u0ndjt4jN3", "In Tvvitter jail for calling out liberals for crying like infants that POTUS told the truth about #Charlottesville https://t.co/fipeI9hEdE", "Tech experts, Human Resource specialists warn about \"public shaming\" of Charlottesville protestors #HR Found at https://t.co/3z6Q5DzUCf", "‘Daily Stormer’ sending Nazis to harass funeral of woman allegedly killed by white supremacist in Charlottesville https://t.co/CRgcShLqgI", "Not condemning Nazis is bad enough \nActively defending them is disgusting and evil beyond words https://t.co/L4G8dZtOAP", "@eqracer @SheriffClarke If this guy wasn't wearing a badge how do u think he'd be greeted in Charlottesville?", "#Internacionales Felicita Ku Klux Klan a Trump por ‘decir la verdad’ sobre Charlottesville https://t.co/n5pLfedLav https://t.co/n3CPHfKuLo", "\"I wanted to make sure, unlike most politicians, that what I said was correct.\" -President Trump https://t.co/E2mmORQbMt", "\"You may not agree but we need to understand. This dividing up of groups with levels of victimhood+oppression has a very negative end game. https://t.co/49hsl41E89\"", "Right back where we started the week on #Charlottesville: moral myopia, lies, #SelectiveSilence from 45 re #WhiteSupremacy. For shame.", "Like the guy from Reno w/ the tiki torch, or Heather, the girl who was killed in Charlottesville,or Zimmerman, or Trayvon,you get the point.", "Omg ! I can't even watch this https://t.co/cXtmDSuYko", "How can one segue from questions about Charlottesville to bragging about (imagined) job creation?", "https://t.co/RXubkNPoAz", "@OsirisAvatarLol @Lebanese_NatSoc @jennybhill @Dub_scratch @FrameGames @POTUS https://t.co/nJgH4c6vI6", "The 14 most shocking comments from Trump's Charlottesville news conference https://t.co/GOOFRr8Xfp", "GET HIM OUT OF OFFICE I MEAN WHAT ELSE DOES HE HAVE TO DO TO SHOW HES 100% UNQUALIFIED FOR THE POSITION OF PRESIDENT https://t.co/ixd6jv7VP5", "Yes! Would like to know where they stand. https://t.co/Pdjpuv6HON", "Orange say wah? https://t.co/3nbku8UuXb", "Lmaooooooo https://t.co/NKRE4Xoegy", "Bombshell Connection Between Charlottesville, Soros, CIA https://t.co/rR8PNLlwTe", "@GovernorVA Please protect this family\nhttps://t.co/DJgzJ88k8H", "NYTimes: Trump Defends Initial Remarks on Charlottesville; Again Blames ‘Both Sides’ https://t.co/2N44egeHSO", "With teamwork and hustle, Toledo Blade dominated after Charlottesville attack https://t.co/jMq860wiCF via @cjr", "Right again! https://t.co/mGAR2onQ2k", "Donald Trump Is Lying About Charlottesville, Says Witness | All In | MSNBC https://t.co/BBzeYVFcsS", "Keep it up MSM. shit like this only guarantees two terms. https://t.co/qGN1MbajIt", "What about the ‘Alt Left’?: Trump sets off more outrage with new Charlottesville comments https://t.co/tL5GY4RgC0", "Thread about genocide in Rwanda and weapons caches in Charlottesville. https://t.co/jqFQg2Sqyc", "Man pictured using homemade flame thrower on white supremacists speaks out https://t.co/uiGu7M01Em He just happened to find an aerosol can?", "Top story: David Duke on Twitter: \"Thank you President Trump for your honesty &amp;… https://t.co/ixKdMK85m7, see more https://t.co/Acepukxnx9", "Save yourself, sir, and get pint https://t.co/R5z5w0iPeT", "I know MOST of you are pissed right now, but this documentary was made during the Charlottesville protest by... https://t.co/cj7B0RbrjR", "Look at @MaggieNYT's timeline. She's had enough. So has @JRubinBlogger. Two bad-ass reporters. https://t.co/niElEXNCdx", "Charlottesville Suspect Might Have Received Tacit Support From High-Level Gov't Figure https://t.co/8rK0C9Mdk5\n\nis the Onion still satire??", "@guardian https://t.co/ZxYfTspKFt\nGreat article but small correction: the National Guard and the Army Reserve are not at all the same thing", "How the Charlottesville suspect became radicalized https://t.co/pYsmNJ83TA", "Watching Krauthammer just shut Laura Ingraham down here brutally almost makes the day worth it. No mincing around. https://t.co/rrpYxaT70q", "Vice News just released chilling, must-watch footage from behind the Charlottesville battle lines. https://t.co/EdKHzrnUZX #NWO #Conspirac…", "Ok, twitter better pay for the damn wedding https://t.co/jUzOga7Hzz", "RT jonfavs: This is who your company's associated with, generalelectric, Boeing, Walmart, pepsi, Campbells, JNJCar… https://t.co/m6Akupx7Ck", "Head of main US labor union leaves Trump panel over #Charlottesville response https://t.co/UGLJ3HnXDS https://t.co/Loe8BD35a9", "@kristinrawls For your followers, it's \"Bonus Pod: Charlottesville\" and McAuliffe speaks about the caches at about 43:30.", "It's sickening https://t.co/YVs6h5Smix", "@DrDavidDuke this is your boy. https://t.co/C2Mg0HPSlo", "Top Dog worker in Berkeley loses job after he's outed as Charlottesville protester https://t.co/xtcsNqaqsY via @USATODAY", "Warning: vicious &amp; brutal. @realDonaldTrump https://t.co/D98R6mCcSn #Charlottesville", "\"The President of the United States revealed so clearly who and what he really is.\" @AC360 @CNN https://t.co/ex9Vun3CkN", "Especially after #Charlottesville, it's not about what's in a legislator's heart but what they put their name on. #SB4isHate #txlege", "Hey Republicans!  Your #WhiteSupremacistPresident is starting a Civil War in 2017. Is this what you wanted?   #ImpeachTrump #Charlottesville", "\"And @RealDonaldTrump today DEFENDED the race haters in #Charlottesville who marched w/the Nazi flag right alongside the American flag! https://t.co/zzdgZ1NjtO\"", "\"It's not just the people you're emboldening--it's the people you're abandoning.\" https://t.co/eA2qK7M4PX", "@IvankaTrump is as #Jewish as the Nazis are #Christians... #Charlottesville can't even step up for what you \"believe in\"", "\"Nothing can blame president. It ‘s some Americans are hatred,  violence for anyside were wrong. President Trump have ppl fully support. ❤ https://t.co/oa35TlbSl1\"", "Stephen delivers as always https://t.co/JczUwQgWb4", "\"@SLapprich @BeianNorma @mitchellvii @ForTrump Donald Trump, this is the type of supporter you have, Republican Nazi sympathizer. Doesn't it make you proud?  https://t.co/d9VHhMVGN3\"", "The entirety of the presser was a lowlight, you lowlife. #25thamendment https://t.co/fgQBxHZmgZ", "\"I find it so hard to believe people are continuing to have these come to Jesus moments about Trump. He has been like this the WHOLE time https://t.co/8XYjUdhdiw\"", "You wanna send a message to the white power protestors-ignore them. No anti protest shut the town down no cameras. #Charlottesville", "\"Paypal reiterates they don't do business with Nazis, white supremacists, KKK. If some slip through, let them know. https://t.co/5XDKfc6vkz https://t.co/yMb14rkx5Q\"", "@realDonaldTrump https://t.co/KGBHRmqAZb\n\nDemocratVotedTrump! PROUD Pres Trump called out this group too!!!", "President Trump backtracks to blame both sides in Charlottesville violence https://t.co/PUOGI3BSTc via @YouTube", "Have to say, this is chilling to the bone...a must watch for anyone with a conscience. https://t.co/EesJ2O1CLL", "They don't even mention the POS that killed that poor woman, they act like Trump drove the car!! https://t.co/hx4kJHsmOm", "#ImpeachTrump #QuitTheCouncil https://t.co/GuMute3EH6", "Charlottesville Democrat Resigns As His Racist Messages LEAK https://t.co/ApqB9qwK2E", "\"@MattTalhelm I would add the @VAGovMansion and Mayor of #Charlottesville for stand down orders given to #lawenforcement putting lives at risk\"", "Saying \"both sides are to blame\" in Charlottesville makes Trump a racist. Is akin to saying she deserved to be raped 4 what she was wearing.", "\"i know i'm cynical. but i can't be the only one who sees this bs for what it is? this is to save their ass on recruiting black athletes https://t.co/bmibLfpfaD\"", "@GovernorKayIvey https://t.co/UUItukXnsJ", "\"He literally cannot unite the country at this point (if he ever could have after that campaign). Think of something else. https://t.co/k0UU927A1g\"", "\"@FoxNews The left wing fascist in Charlottesville are called Antifa. They are very violent. Antifa is the armed wing of the Democrat party #deepstate\"", "Disgusted and horrified are the only words that come to mind https://t.co/ngvE1UClsM", "\"Yeah, wasn't Gen. Kelly supposed to be the Tamer of the Wild Beast we have as @POTUS in the @WhiteHouse ? #ImpeachTrump https://t.co/yOp1lv5E2b\"", "Right on. https://t.co/cUwnA4Geif", "Judge Napolitano talks DOJ probe of Charlottesville attack \u0096 TruthNation https://t.co/4FrRm84UDY", "Fascinated by the word \"muscular\" in American political vocabulary. Seems to mean \"thuggish in a fashionable way.\" https://t.co/DTqtnldE2h", "Trump: 'Both sides' to blame for Charlottesville @CNNPolitics https://t.co/TkyCGQMUMZ", "Why the Nazis Came to Charlottesville https://t.co/A3GdpusoFY", "Vice News Just Released Chilling, Must-Watch Footage From Behind Charlottesville’s Battle Lines – Mother Jones https://t.co/7j215Of3Jy", "'Both sides to blame' for Charlottesville violence, Trump says https://t.co/W7eYb9V499", "@Baileyash06 lmao I love @jimjefferies https://t.co/OEolW5dwai", "\"White supremacist attitudes are morally wrong and sinful, and we condemn them\" https://t.co/JJyPWRXOUS", "#HOFLIV \n#HOFLIV\n #onweer\n #Charlottesville\n #PKP17\n #moederdag🎵🙀\n\n https://t.co/S1N2wMJKe4", "BBA Charlottesville Response. Click on link to read the entire article and please leave a comment.\nhttps://t.co/QjPTPFtrEG", "Watch the Vice Documentary on the Charlottesville White Supremacy Rally... https://t.co/weYNcvQYbp", "After Charlottesville, Trump's business buddies have no excuse to stick around https://t.co/5La4OTqMIX", "About white supremacist... \nhttps://t.co/KUIQpXpge2", "The time between Trump saying Nazis are bad and him creating / blaming an \"alt-left\" for Charlottesville is smaller than his hands. 👶🏼🤚🏼", "The coded alt-right signal Donald Trump uses to defend white nationalists in Charlottesville https://t.co/CWTJDYznm6\n#Trump", "\"Retweeted Gizmodo (@Gizmodo):\\n\\nEven neo-Nazis are surprised by Trump's latest Charlottesville comments … https://t.co/2a1cxLurSg https://t.co/9U4pJHxGeB\"", "\"Dear congress, is it time? Or do you encourage more bloodshed?Do your jobs and remove this man before he gets people killed https://t.co/RLf1q1aVZ9\"", "\"Heaven will be a white supremacist's hell\" \n\n- Pastor Matt Chandler speaking out on #Charlottesville", "Republicans denounce bigotry after Trump's latest Charlottesville remarks https://t.co/oNsxmsWNYE", "Horrific is the correct term. It's sickening https://t.co/8i6mQ8XtLC", "Everyone needs to watch this from start to finish. There are no words... https://t.co/98yqX8mMQW", "More False Commentary from @CNNPolitics https://t.co/vrJo1RfqtR", "Terrorism Deaths by Ideology: Is Charlottesville an Anomaly? https://t.co/ROBOfp0nnB via @CatoInstitute", "So does Paris not get paid by GOP if he doesn't say the magic words? https://t.co/ZV4Wz3X7Eh", "Such a piece of shit. https://t.co/A9uANBlcw5", "A lot of people in #Charlottesville say it's time to reckon with the town's history of racism. https://t.co/CaJjaXw30v", "RT TruthFeedNews: VIDEO : Sheriff Clarke is \"PROUD\" of Trump’s Charlottesville Response https://t.co/Zo0KgdmzAp via truthfeednews  #maga #…", "Trump still refuses to call it domestic terrorism https://t.co/GTYiPG7a2Y", "The WH tells #LIES https://t.co/zFQZN9yhRB", "Add your name: We, the people of the United States, denounce white supremacy #Charlottesville https://t.co/SqL4zGksPR @moveon", "\"When you listen to these cowardly disgraceful men I am just disgusted. They work and live in our community. They have families. So sad! https://t.co/BhErdt63Bd\"", "Donald Trump Blasts Reporters at Trump Tower For One-Sided Charlottesville Reporting!", "Lock Trump Up Lock Trump Up https://t.co/5tEPKN6pU9", "\"#HeatherHeyer 's parents and all those injured in #Charlottesville should sue @FoxNews, @TheDailyCaller and #TuckerCarlson https://t.co/n09XtcsdfA\"", "Trump Gives White Supremacists an Unequivocal Boost via @NYTimes I'll wager there's intent behind all of this...  https://t.co/p5ZHUi9aeO", "\"INVESTIGATE MCAULIFFE/BELLAMY COLLUSION ON CHARLOTTESVILLE\\nFOIA @governorva emails, phone calls leading up to it w/\\nvice-mayor @DrWesBellamy https://t.co/aP9pMy8qf3\"", "\"@kylegriffin1 Trump’s an ass but you’re deceiving us by not including that two reporters asked if he planned to visit Charlottesville b4 he said that.\"", "\"@PaulMorphyblog @taryngracia @Haydar79 @TalbertSwan @realDonaldTrump \\\"Thank you President Trump for your honesty &amp; courage to tell the truth about #Charlottesville\\\" David Duke\"", "Breaking Crazy: Donald Trump's Charlottesville Press Conference https://t.co/rijjUkpo1o via @YouTube", "College GOP Prez Busted at Charlottesville Rally Says He’s Being Smeared: ‘They Have No Proof I’m a Racist’ https://t.co/X6zukaogEx", "Lacks moral courage. Nothing else to say. https://t.co/qlocDxIM2O", "I liked a @YouTube video https://t.co/doRepqlXX1 What They're NOT Telling You About The Charlottesville Race Riots", "\"@SenToomey @SenateGOP HouseGOP @KeithRothfus do you stand with or against @potus and white supremacist hate? Time to choose. #ImpeachTrump https://t.co/6JZe1ayBjl\"", "This Vice News Documentary from Charlottesville Is Horrifying https://t.co/DyQzhNmpsn via @Esquire", "I feel an insanity plea coming on... https://t.co/nGnzKaWdB7", "@okdeadhead @mikelowetpt https://t.co/ue8M0z7ZAU", "Everyone watch this. https://t.co/kgqScEI5co via @VICE_video", "\"No hemming and hawing at Charlottesville or Trump Tower. Congress and no one but Congress will go down as traitors or as heroes. Impeach https://t.co/I9Y6zBVLeP\"", "Here’s How Virginia State Police Facilitated Violence At Charlottesville https://t.co/tsql0wyz2r via @dailycaller", "My college town BAYBEEEE https://t.co/jvn2cmItdd", "#GOP &amp; #dems speak out very clearly against #racism &amp; white supremacists. Only one who isn't being clear... #Trump https://t.co/PYwx5FV4KT", "Dear @realDonaldTrump, these are the '\"fine people\" you were defending today - funeral crashers https://t.co/tReEap675g", "Even more importantly it's more or less being treated as a \"normal\" news cycle like health care or POTUS' vacation days #charlottesville /4", "Even if you never make it to #Charlottesville or to Wash https://t.co/552qlxfa1v", "Just watched the #ViceNews special on #Charlottesville, and I've never seen a more weak, whiny, bunch of little bitches in my life.", "I'll go first — Tyler put his body on the line for me &amp; the Charlottesville I love, so money is literally the least I can give to repay him.", "They say it got so bad in Charlottesville because the police would not step in. It seems that the Mayor told the... https://t.co/jUAo7bBxvl", "@realDonaldTrump THIS WILL NEVER BE YOU! https://t.co/MgSt1BY5mw #ImpeachNow #FakePresident #LiarInChief", "#ImpeachTrump https://t.co/yP4Vf9UFff", "It's crazy how much hate can consume someone.  It truly is so much easier to love. https://t.co/eYWJQtSuFB", "\"With the exception of the words \\\"so called\\\" I agree with this assessment 100%. It's not a President's job. To love on our behalf. https://t.co/hbNvSJbBP2\"", "Terrorist Who Beat Deandre Harris With A Pipe in Charlottesville Found On Social Media. Updated. https://t.co/MeibzfX1ql", "Defending the white supremacists?? Is this real life!? Ok.ok. Time to go Trump. This is fuckery at it's FINEST!!! 😷 https://t.co/UAu8PZiQD3", "Charlottesville Attack: Brennan Gilmore - Witness or Accessory? \nhttps://t.co/jnWI4PngBi", "#Resist #Trump #Resistance #ImpeachTrump #impeach #Charlottesville https://t.co/ldxrtYeukG", "What Jewish Children Learned From Charlottesville via @NYTimes https://t.co/PtGJkOV0WZ", "\"Oh Obama Obama Obama -the worst most debauched,degenerate, traitorous, dirty, Marxist, disgusting President in all of United States history. https://t.co/7yKPivzMIN\"", "Charlottesville VA, Paid Protesters Antifa, BLM, Etc, chant \"We are Replacing You...\" - YouTube\n\n#AltLeft https://t.co/AJC7zTZCtN", "\"@Donald_E_Heller According to the Charlottesville police, the reason was the fascists were much better armed (semi-automatic weapons) thanks to open carry.\"", "fool https://t.co/b1KMG0YvX4", "Video: Deandre Harris Speaks Out About Being Assaulted By White Supremacists In Charlottesville, Virginia! https://t.co/l5sw87ozKc", "Daily Stormer website sending Nazis to harass funeral of woman killed by white supremacist in Charlottesville https://t.co/BFYdwleQRK", "@Pamela_Moore13 @thomasjulian7 Check out @jojoh888's Tweet: https://t.co/t305ZiUNYh", "what in the fuck...... https://t.co/VlK8qtZJtF", "\"Thanks 4 sane comment #p2 #millenials #veterans #tcot #tlot #ccot #BLM #LGBTQ #LatinoAmerica #UniteBlue #TheResistance #maga https://t.co/8tPzx2poym\"", "I've had Republicans give me more shit for my freedom of speech as an Atheist than they gave the Nazis this weekend in #Charlottesville", "Trump's Inability to Unequivocally Condemn Charlottesville Nazis May Be Rooted in Love of Illiberal Exclusionism: https://t.co/zH23e1ggCl", "\"God I just ❤️ our @POTUS. @GOP, take a good look. THIS is what it looks like to stand firm when your position is just.  #nonPanderingPotus https://t.co/uqRmOFTEpu\"", "(sigh) Big surprise there..... https://t.co/ulxvGMtreM", "\"@nee_nee6 @FoxNews @TuckerCarlson this video proves you wrong. Watch VICE News Tonight’s full episode \\\"Charlottesville: Race and Terror\\\" https://t.co/rtjEpv0XMJ via @vicenews\"", "#quitthecouncil https://t.co/AaYiMiHHlk", "Donald Trump: I didn’t have all the facts for first statement on Charlottesville violence - https://t.co/dDzawvScZX - @washtimes", "@donlemon your statement regarding #Charlottesville was eloquent, passionate and true. Thank you good sir.", "The Universe has shaken you to awaken you. - Unknown #Charlottesville\nMeridian Hill Park| August… https://t.co/Gwzd5fjCBg", "Charlottesville violence is all hate from one very WRONG, evil side. @CoryGardner @marcorubio @tedcruz Act. Sack up. @POTUS needs to go.", "Never forget which political party led us to this:\nhttps://t.co/9AVXNSYUlY https://t.co/mKJbbvqNtz", "A \"fine person\" who showed up just to support a statue would've left as soon as they saw all the swastikas/racism. #Charlottesville", "Walmart Stands with Radical Left Regarding Trump C-Ville Response https://t.co/XJtiqPQ3b8 via @ConstitutionNat", "It amazes me that we have a president that is more upset about a statue than people who died in a Nazi protest. #Charlottesville #impeach", "Trump defends his delayed response to violence in Charlottesville https://t.co/okbCOrskd6", "Trump Gives White Supremacists an Unequivocal Boost via @NYTimes https://t.co/k3iGkYyZsy", "\"@USAlivestrong @grantstern @mea_mark @rockbmg1 @JoyAnnReid The more people listen to her the more they disliked her. This moron and the DNC built Charlottesville\"", "@RepLanceNJ7  This is the man who fueled the other side. Read and watch. https://t.co/UnDfnsLy8r Hope you will start supporting @POTUS", "\"Well presented, on target, &amp; I agree with every single word. Thank you @sethmeyers for being unafraid to address hatred in the oval office. https://t.co/KkWLgCtenb\"", "82nd Airborne calls out white supremacist for wearing their hat at Charlottesville https://t.co/oiMRgz1KtV", "\"@SpeakerRyan Then DO something about it. Stop the WH babyrat racist. Get the GOP on board. You're speaker of the fuckin' house dude! #Charlottesville https://t.co/aQyqnWyKOJ\"", "\"Please just let any normal person of average intelligence &amp; with a simple moral compass be in charge. Anyone. Anyone. #Charlottesville https://t.co/LqOSRtpE97\"", "Trump's defense of the 'good people' at Charlottesville white nationalist march has David Duke gushing https://t.co/ykqMTo72jl", "\"@BlairMellark @Ben_Allen23 Then he denounced all violent actions that took place in Charlottesville which byw is in stark contrast to the left's dialogue (3)\"", "rack em https://t.co/VVUq1jypBP", "This dude Bakari Sellers just won the night by calling @realDonaldTrump the White Supremacist In Chief. #Charlottesville #FuckTrump", "\"Vinegar Hill; Charlottesville. A Thriving Black Community That Was Razed To The Ground... https://t.co/jg36sjYqU0 #blacklivesmatter #horror https://t.co/5BpMJsFx1t\"", "Trump will be tweeting this tomorrow. https://t.co/KcgLWYCoLY", "#visionontv Donald Trump's Charlottesville Press Conference Has Roots in Fox News and… https://t.co/4bwJWBmkpk", "I tweeted her to delete this 5 minutes ago and No was winning, wtf https://t.co/7gi9FMHzcp", "Trump Is Lying About Charlottesville, Says Witness | All In | MSNBC @chelseahandler @marycmccormack @Siriusjay https://t.co/cYcOxWGYiO", "Terrible warnings https://t.co/n1GKvYCfn9", "😡😡😡😡😡😡😡 https://t.co/9mq7qkakSQ", "Thus is the other side that you say opposes racism and bigotry.  https://t.co/ny3cxBoAA1   Maybe fix your tweet! https://t.co/WWCzYc9ufd", "\"If wishes and butts were clusters of nuts, we'd all have a bowl of granola.\" 🤣😂🤣😂 https://t.co/3km7HxU06o", "A real hero https://t.co/aoRYogRpAe", "Bannon, Charlottesville Violence and White Nationalists: Why Trump's Chief Strategist Remains ... https://t.co/1k97F9HfR6 #FeelTheBern #Sa…", "Who even are you https://t.co/JN16rTv4aX", "Trump Gives White Supremacists an Unequivocal Boost, via @nytimes https://t.co/GIy5x2ptEm", "\"Good for you GOP bravehearts; uphold core American values which makes this a great nation #Republicans #Democrats #POTUS45 #PoliticsToday https://t.co/B0sfiUJwCr\"", "@kayleighmcenany \nHow can you look in the mirror?\n#Charlottesville #HeatherHeyer https://t.co/cgmsL8OLc1", "Finally watched this chilling insider video of the Charlottesville protests by VICE. You should too. https://t.co/1NHz5DVY1J", "#sportsnews Lions condemn 'any use' of logo at Charlottesville event https://t.co/lcoYGpfrH5", "Fuck Nazis. Fuck Fascism. Fuck Trump. And fuck Trump's \"supporters\" hardest of all. #Charlottesville https://t.co/1A8L7yKTIV", "Watch VICE News Tonight’s full episode “Charlottesville: Race and Terror” – VICE News https://t.co/WbYO2LssuM", "Donald Trump&amp;#039;s Charlottesville Press Conference Has Roots in Fox News and Twitter https://t.co/GyEZMUBNHD", "\"Another #Trump troll blaming counter protesters for a white supremacist killing #HeatherHeyer. They right sank lower after #Charlottesville. https://t.co/6tSJvqI7BZ\"", "https://t.co/RPhUh0XNRV\n#Charlottesville \n#kkkrally \n#ImpeachTrump \n#news \n#AltRight \n#WhiteSupremacists \n#WhiteSupremacy \n#southerncharm", "To all the groups aimed at in Charlottesville, I'm so sorry for the way you were treated. We stand with you. This is NOT our president.", "The alt-left are communists Marxists, and Democratic-Socialists; I despise them all.  via the @FoxNews App https://t.co/VnyjZsY6J5", "didn't this guys son get arrested for rioting with Antifa? https://t.co/nAZix0iFgW", "These crazy #kkk #WhiteSupremacists are an #AmericanDisgrace I'm sickened! https://t.co/h6v8U0eTK1", "Great Thread!! 👇🏽👇🏽👇🏽👇🏽 https://t.co/GxTrtlai2J", "\"We need someone who can run the country like a business,\" they said. https://t.co/BoBHrluSfd", "\"he started that White Student Union &amp; chalked \\\"White Pride\\\" &amp; vowed to roam campus looking for black criminals...we tried to tell yall then https://t.co/4P4kUCROri\"", "ABCNEWS reports With nearly 2.8 million likes, Obama's response to Charlottesville attack is now the most-liked tw… https://t.co/ErpVzNol8C", "\"@AnnCoulter @realDonaldTrump Were the Democratic Governor and Mayor complicent in allowing the riot in Charlottesville to happen for political purposes? FBI must check!\"", "\"@Mavspur1 @maziehirono SHATZ SHOULD NOT REPRESENT THE PEOPLE OF HAWAII WHO HAVE NOTHING TO DO WITH HOW HE FEELS ABOUT CHARLOTTESVILLE..... PUT ON UR BIG BOY PANTS!\"", "Watching the VICE documentary about Charlottesville after listening to Father John Misty is a trip straight to Humanity Is Hopeless Town.", "Add your name: We, the people of the United States, denounce white supremacy #Charlottesville https://t.co/DIionxIDFd @moveon", "Trump addresses Charlottesville clashes (full) #america #trump #war #usa https://t.co/5caaZHpMjD via @sky1876online", "Charlottesville driver previously accused of beating mother. https://t.co/01ydFwIgXI https://t.co/jKv73e0Evn", "\"How come his handlers don't step in when he starts spouting bullshit? Are they all gone or is is a \\\"let the infant burn himself\\\" situation? https://t.co/3FNSTFGmZt\"", "No, Mr Trump, we're not the same as the neo-Nazis https://t.co/jMjwlOW5GI", "'ENTIRELY CORRECT' WH stands by Trump's Charlottesville statement https://t.co/PF2udsOI1V", "Of the three Trump's we've heard on Charlottesville, today's is the one his aides apparently hear in private https://t.co/Tusc0E1Ith", "white friends: an important read on how to go forward from #charlottesville https://t.co/12cpkzvUAR", "\"She can honestly go to hell. Y'all listened to her, threw your vote away and now she has the nerve to discuss a way forward. #ByeFelicia https://t.co/g5pusKh8iy\"", "@slimbabii2 BLAST THIS LOUD AS YOU CAN🔊\n\"Welcome 2 AmeriKKKa\"\nDedicated to AUGUST 12th in my city #Charlottesville \nhttps://t.co/N0KP9YbZut", "\"#ImpeachTrump NOW! He is tearing this country apart piece by piece! #trumpisaracist #TrumpIsAFascist #TrumpsAmerica #Trump #Charlottesville https://t.co/387mO9wPDr\"", "White Supremacy is Home Grown Terrorism  https://t.co/Q1ofGWYZFP #trump #Charlottesville #WhiteSupremacists #NeoNazi #KKK", "PS he doesn't know a lot about Charlottesville. Nobody wanted him here.", "Full text: Trump’s comments on white supremacists, ‘alt-left’ in Charlottesville - POLITICO https://t.co/QW0aHoEaed", "#FacePalm\nHe can't help himself. He's like a teen klepto in a toy store https://t.co/gRWl8sOxhv", "@StefanMolyneux please rt that our government just raised Antifa flag where is the outrage https://t.co/hgkpfgh2Y8", "\"Hey America #Charlottesville #ImpeachTrump is about ousting our #PresidentTrump &amp; has nothing to do w/ race relations. WE MUST FIGHT LEFT! https://t.co/reZTXF8V7S\"", "Trump blows up damage control he blames 'both sides' 4 Charlottesville via @POLITICO for iOS https://t.co/ORmZ4qIpQn https://t.co/yGrvqbGbt6", "https://t.co/1zi1DelnWx Ultimate proof the fake news is responsible for #Charlottesville", "\"Wtf does a winery have to do with anything and how are jobs going to stop nazis from hating 😂😂 this guy is actually a joke https://t.co/EBCuLZCBZC\"", "Trump doubles down on response to Charlottesville https://t.co/33P3mViZye", "He looks so good 😍😍 https://t.co/TAnd4QYsmS", "White supremacist, former KKK member David Duke praises Trump’s ‘alt-left’ Charlottesville comments https://t.co/7l0HBL850s", "No one is \"fine\" who has hate in their heart for an entire group of people based on looks or heritage #Charlottesville #realnews", "So...the alt right is getting special treatment in the WH- good to know #charlottesville https://t.co/u320hyTkSk", "Charlottesville Car Attack Victims Sue James Alex Fields and Rally Organizers for $3 Million https://t.co/HutF52ltPs via @TMZ", "David Duke thanks Trump for blaming 'alt-left' for Charlottesville https://t.co/jsMylKPQTJ", "Sue the city where were the cops.. why watching doing nothing https://t.co/QAVZyopCTN", "Rochester responds to Charlottesville - Rochester City Newspaper https://t.co/5ImpZcqiXI #rawfoodlivefood", "Amen @VanJones68 https://t.co/MwbOKfBYyQ", "Why are you asking questions you should already know the answers to??? https://t.co/q579vp3n8z", "Alex Jones says Jewish actors posed as KKK followers in Charlottesville https://t.co/5ChnvI5Pae", "When you know you lost that battle. https://t.co/qjDOzbbwK5"]